{
  "episodes": [
    {
      "title": "Ep. 44 – Do Things Better ",
      "description": "Do you ever clock mitzvos off your list without tasting their sweetness? The Ramchal teaches that beyond performing good deeds, we must \"feel\" them—examining the quality of our kavanos and the depth of our engagement. It's easy to assume that showing up counts for everything: standing for Shemoneh Esrei, opening a chumash, or raising our cup on Purim. But are we really immersing our hearts in the avodah, or merely going through the motions? This episode will show you simple yet powerful ways to upgrade your service—refining your focus, amplifying your kavanah, and infusing every deed with genuine feeling.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "30-09-25",
      "length": "6:55",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/38xtYMifFw1IX7WwRvuGfg",
      "series": "mesilas-yesharim",
      "episode_number": 44,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 43 – Am I Really Doing a Mitzvah",
      "description": "Do your mitzvos sometimes feel like empty rituals rather than soul-fueling acts? The Ramchal teaches that performing a mitzvah without genuine kavanah is like drinking from a mirage—on the surface you're \"doing\" the commandment, but your nefesh remains thirsty. We may rush through Purim l'chayims or recite brachos by rote, yet miss the heart of the avodah. How often do we pause to ask, \"Am I fulfilling this mitzvah for its true purpose or just to check a box?\" This episode will guide you to excavate the inner life of your mitzvos, transforming duty into delight so each commandment becomes a genuine encounter with Hashem.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "23-09-25",
      "length": "6:11",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1FCrXAy6VuN8PEr5vkyedS",
      "series": "mesilas-yesharim",
      "episode_number": 43,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 42 – What Am I Doing ",
      "description": "Have you ever looked back and realized you've been sleepwalking through your own story? The Gemara in Eruvin delivers a shocking truth: it might have been better never to be born—unless we seize the chance to \"check our ways\" while we still can. Yet most of us shy away from that mirror, preferring comfortable narratives to hard truths. What hidden detours have you been taking? How different would your choices be if you paused to ask, \"Is this the right path for my nefesh?\" This episode will guide you through the crucial steps of cheshbon nefesh—defining what deserves your commitment and courageously comparing that to your daily reality.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "16-09-25",
      "length": "8:07",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2SZN6hbvr8HGqVx99QeuJ1",
      "series": "mesilas-yesharim",
      "episode_number": 42,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 41 – Truly Know Yourself",
      "description": "What truths lie hidden beneath your self-image? The Ramchal teaches that genuine growth begins when we confront our real standing, not our preferred fantasy. It's easy to coast on comfortable illusions—\"I'm fine as I am,\" \"It's not my fault\"—but those self-deceptions steer us off-course. Why do we cling to excuses instead of embracing the power to change? This episode will guide you through the vital practice of cheshbon nefesh—honest self-audit that roots out hidden flaws, ignites lasting improvement, and truly aligns your path with Hashem's purpose.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "09-09-25",
      "length": "5:57",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/7bCeq9W1gSlXvM4idQELBv",
      "series": "mesilas-yesharim",
      "episode_number": 41,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 40 – Develop Your Instinct",
      "description": "What if your soul's survival depended on split-second reflexes? The Ramchal teaches that true z'hirus isn't only thinking before you act—it's training your instincts so that when temptation strikes, you respond correctly without hesitation. Just as a commando drills for crisis, we must forge spiritual \"muscles\" to look away from forbidden scenes and seize fleeting opportunities for mitzvah. How do you reprogram reflexes that betray your higher purpose? This episode will show you how to lay the groundwork today through targeted mental rehearsals and deliberate habit-building, so when the next nisayon arrives, your instinctive response steers you toward holiness.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "02-09-25",
      "length": "00:06:08",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4wPsVn97hVo4d7Wq4FAbX2",
      "series": "mesilas-yesharim",
      "episode_number": 40,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 39 – What is Really Important in Life",
      "description": "When was the last time you paused to ask what will matter when you look back on your life? The Ramchal teaches that true greatness comes from daily cheshbon nefesh—taking stock of our purpose and our performance. Yet we often chase fleeting thrills only to wonder at eighty where the years went. Why do we invest energy in trivial pursuits when our spiritual balance sheet goes unchecked? This episode will guide you through the two-step process of cheshbon nefesh: first, clarifying what really deserves your devotion, and second, honestly assessing whether your daily actions match that vision—so you build a life you'll be proud to remember.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "26-08-25",
      "length": "00:05:49",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/00i335k9YrAIe64wrqAnxT",
      "series": "mesilas-yesharim",
      "episode_number": 39,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 38 – Help Yourself",
      "description": "Have you ever waited for divine rescue without lifting a finger? The Ramchal teaches that while Hashem is our ultimate Helper, He won't save us unless we first open our eyes and take action. It's tempting to blame our struggles on fate or cover our ears and pretend nothing's wrong, but without genuine self-awareness and effort, even miracles remain out of reach. Why do we expect Hashem's support when we won't support ourselves? How can you ignite your own will to change before calling out for aid? This episode will inspire you to begin with honest self-examination—showing you how to \"help yourself\" by opening your eyes to challenges, awakening your inner resolve, and turning to Hashem with heartfelt tefillah.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "19-08-25",
      "length": "00:06:19",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6Bnqau0oNr3Oo27e6VQsyc",
      "series": "mesilas-yesharim",
      "episode_number": 38,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 37 – Being Honest with Yourself",
      "description": "Do you dare to face the unvarnished truth about your own motives? Our master, the Ramchal, teaches that the loftiest service begins with middas emes—raw honesty before Hashem and oneself. Yet so often we spin comforting stories—\"I'm too tired,\" \"Everyone else does it,\" \"It won't hurt\"—just to dodge the sting of guilt. What distortions keep you from seeing your real priorities? When was the last time you confronted your own contradictions instead of brushing them aside? How might embracing brutal self‐truth unlock genuine growth? This episode will guide you to shatter the illusions you cling to, harness Divine aid in your inner battle, and build an avodas Hashem rooted in authenticity rather than self-deception.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "12-08-25",
      "length": "00:04:53",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2kss00sWvKMXuYLTTHzIJ1",
      "series": "mesilas-yesharim",
      "episode_number": 37,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 36 – Think Before it Happens",
      "description": "Have you ever found yourself scrambling for a solution only after the crisis has struck? Mesilas Yesharim warns that the yetzer hara floods our lives with relentless demands so we never pause to prepare. But Chazal implore us, \"Put your heart onto your ways\" (Mishlei 23:19)—to build foresight before the storm. Why do we leave our spiritual \"crisis management\" until we're already under fire? How might calm reflection today spare us from panic tomorrow? What if the secret to resilience is less reaction and more anticipation?This episode will teach you how to carve out quiet moments for honest self-audit, develop instinctive safeguards against temptation, and establish \"pre-game\" strategies for your avodas Hashem—so that when challenges arise, you meet them with confidence rather than chaos.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "05-08-25",
      "length": "00:06:18",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1WlSmORloDX93c3UWeqnIJ",
      "series": "mesilas-yesharim",
      "episode_number": 36,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 35 – Are You Thinking",
      "description": "When was the last time you paused to question your own actions? Mesilas Yesharim warns that the yetzer hara's greatest weapon is relentless pressure that robs us of reflection, turning us into mindless horses charging headlong into sin. A fleeting guilt can haunt you—so much so that you grind it down through repetition until you feel nothing at all. Why do we allow external stress to drown out our inner voice? How often do we simply obey impulse rather than ask, \"What am I really doing?\" And what would happen if you reclaimed just a moment to think before you act?This episode will show you how to recognize the subtle tactics of the yetzer hara, build the habit of thoughtful resistance, and transform automatic reactions into deliberate steps toward holiness—so that every choice you make is grounded in awareness and empowered by purpose.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "29-07-25",
      "length": "00:06:35",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0CVvfgcjZTOYv8HekqUGsN",
      "series": "mesilas-yesharim",
      "episode_number": 35,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 34 – Stop Running!",
      "description": "What's driving you forward without a moment's pause? Mesilas Yesharim warns that unchecked momentum can carry us straight into peril—like horses charging into battle without thought. The navi Yirmiyahu lamented our generation's headlong rush into sin, oblivious to the ruin in our path. Why do we barrel through life on autopilot, doing \"what everyone else does\"? How often do we fail to ask, \"Am I running toward holiness or off a cliff\"? And what if the antidote is simply to halt, reflect, and choose deliberately?This episode will teach you how to break the cycle of blind conformity—showing you practical steps to pause, assess your direction, and move forward only when your heart and mind are aligned with Hashem's will—so that every stride you take leads you closer to true purpose rather than disaster.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "22-07-25",
      "length": "00:07:10",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5rzKO2FBRuVMoSctCIWJXp",
      "series": "mesilas-yesharim",
      "episode_number": 34,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 33 – Purposely Closing Your Eyes",
      "description": "Have you ever chosen ignorance over self-preservation? Mesilas Yesharim warns that ignoring clear dangers to our nefesh is like willingly marching into a fire. While we instinctively flee physical threats—red lights, speeding cars—the subtler blaze of ta'avah often ensnares us because we shut our eyes to reality. Why do we swipe social media feeds when we know the soul-erosion it brings? How can we risk our spiritual future for a fleeting dopamine hit? What would change if we treated threats to our nefesh with the same urgency as a blazing inferno?This episode will open your eyes to the hidden fires around you, teach you how to refuse the invitation to look away, and empower you to guard your soul with clear-sighted vigilance—so you walk safely toward your eternal destination.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "15-07-25",
      "length": "00:07:53",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/7Ekv3MVxWDssYXly0KnJKk",
      "series": "mesilas-yesharim",
      "episode_number": 33,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 32 – Care About Yourself",
      "description": "Have you ever hurt yourself by turning a blind eye to your own well-being? The Ramchal teaches that true growth begins with z'hirus—paying genuine attention to your life's path. Too often, we ignore warning signs—like risking our health or our reputation—simply to save a moment or spare discomfort. Why do we willingly trample over our own happiness? How would our choices change if we truly valued our nefesh and treated it as Hashem's precious gift?This episode will challenge you to open your eyes, recognize the stakes of every decision, and develop the self-care that forms the bedrock of all avodas Hashem—so you live fully, safely, and in alignment with your soul's highest purpose.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "08-07-25",
      "length": "00:08:05",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4cUJGPdrjs9dogffkjgxXs",
      "series": "mesilas-yesharim",
      "episode_number": 32,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 31 – Keep Your Eye on the Goal",
      "description": "What happens when you lose sight of your true mission and chase life's detours instead? Mesilas Yesharim reminds us that clarity of purpose—the foundational \"why\" for our existence—is the compass that guides every step of avodas Hashem. Too often, people confuse success, pleasure, or status with genuine kedushah, mistaking an Olympic medal or a fat paycheck for spiritual achievement. Why do our priorities become so skewed? How can we realign our ambitions when every distraction whispers \"this is the goal\"? What if the secret to meaningful growth is simply remembering that this world is just the gateway to something far greater?This episode will equip you to define your personal mission clearly, map out the step-by-step process from z'hirus to kedushah, and develop the focus to stay on course—so that every decision you make steers you toward lasting purpose and eternal reward.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "01-07-25",
      "length": "00:05:42",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2M2U9eI2VSe7E3NP8AbX9H",
      "series": "mesilas-yesharim",
      "episode_number": 31,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 30 – Controling Your Own Mind",
      "description": "What if the fiercest struggle you face isn’t external but inside your own head? Mesilas Yesharim challenges us to recognize that our minds—our very intentions—are the battleground where true avodas Hashem is won or lost. All day long, thoughts intrude: a catchy tune you can’t shake, worries that derail your davening, or desires that hijack your focus. How can we steer these wandering impulses back toward sacred purpose? What shifts when you decide that every intention, whether in work, learning, or prayer, is offered “lishmah” to Hashem? This episode will teach you practical steps to tame your inner dialogue, transform fleeting thoughts into moments of kavanah, and achieve the self-control that underpins genuine spiritual growth.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "24-06-25",
      "length": "8.13 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5DodZVS3ufC7wSUMiTJboz",
      "series": "mesilas-yesharim",
      "episode_number": 30,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 29 – The Purpose of the Pleasures of the World",
      "description": "Do you ever mistake a dopamine rush for your life’s mission? The Ramchal teaches that while Hashem designed Olam Haba as the ultimate pleasure palace, this world’s comforts serve a very different role. We live in a hedonistic culture that chases feel‐good moments, yet the true iker of our stay here is to confront tests and cling to mitzvos. Why are our greatest trials often wrapped in success and abundance? How can we distinguish Divine chizuk from mere distraction? What if the very pleasures you enjoy are invitations to deepen your service of Hashem instead of derailing it?This episode will show you how to reframe every blessing as fuel for your avodas Hashem—so that when pleasure comes, you harness it for growth, stay anchored in purpose, and earn your ultimate reward.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "17-06-25",
      "length": "10.17 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/24MEkqWhxJLyVrdFCv6rRg",
      "series": "mesilas-yesharim",
      "episode_number": 29,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 28 – The Smallest Details",
      "description": "Do you breeze through mitzvos without pausing to notice the tiny moments? The Ramchal reminds us that every detail—like a quarter‐carat on a diamond—can mean the difference between ordinary and extraordinary avodas Hashem. Yet we often dance at a chasuna or learn Torah mechanically, missing the chance to infuse each act with kavanah. How would your simchas choshen look if you stopped for just a beat to remember “I am making a mitzvah”? Why does a single thought before picking up Lulav elevate the entire mitzvah? What happens when we treat our service of Hashem like precious gold, sensitive to even the smallest nuances?This episode will show you how to transform your daily avodah by sharpening your awareness—so that every blink, every breath, and every move becomes an opportunity to draw closer to the true purpose of your soul.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "10-06-25",
      "length": "7.58 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/7t7AakqamqkgzHZmUZBuBK",
      "series": "mesilas-yesharim",
      "episode_number": 28,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 27 – Keeping Focus on What's Important",
      "description": "Do you live life like a passenger in a car, or like the driver? The Ramchal reveals that while every living being has a nefesh—a basic soul that gives it life—a Jew possesses something infinitely higher: a neshama, a soul that originates in the highest realms. But here’s the paradox: our neshama has nothing to gain from the physical world. So why is it here? Why did Hashem place such a lofty, spiritual entity into a physical body? What’s the purpose of a neshama that is so far beyond this world, yet bound to it? This episode will guide you to see your true self beyond the distractions, align your guf (body) with your neshama’s purpose, and keep your focus on what truly matters.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "03-06-25",
      "length": "6.5 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6rjq8OxbEpffYDt8CWBrGI",
      "series": "mesilas-yesharim",
      "episode_number": 27,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 26 – Your Neshamah, Your True Self",
      "description": "Have you ever treated your body like the destination instead of the vehicle? The Ramchal teaches that our neshama is a “treasure from the highest,” totally untouched by physical pleasures and yet lodged within our guf . We live by default as if the body—our senses, comforts, and status—is who we are. But what happens when you recognize that your real identity is this lofty soul, and that your body exists only to serve it? How do we realign our daily choices so our guf becomes a holy instrument rather than the master? Why does the neshama sometimes rebel at leaving the body, and what does that teach us about genuine avodas Hashem? This episode will unveil how to shift from being “the car” to becoming the driver, empowering you to live with purpose—body and soul united in sanctity.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "27-05-25",
      "length": "9.27 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/200pM0pZKZrl2kgT6IjToR",
      "series": "mesilas-yesharim",
      "episode_number": 26,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 25 - Can’t I Just Enjoy Myself",
      "description": "If life is just about enjoying yourself, why does true happiness seem so elusive? The Ramchal teaches that even those who dedicate themselves to pursuing pleasure rarely find lasting contentment. And if life is so fleeting, can its purpose really be to chase temporary joys?In this episode, Rabbi Klapper tackles one of life’s biggest questions: Why isn’t pleasure the ultimate goal? Through a sharp analysis of human nature and the Torah’s timeless wisdom, he explains why focusing only on this world’s delights is a mistake—and how living with purpose leads to far greater fulfillment. You’ll discover how even simple actions can bring deep joy when they’re aligned with something higher, transforming your life into a journey of meaning rather than fleeting moments of pleasure.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "20-05-25",
      "length": "8.1 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0IRuwnsn0AkE74pKf4lzRM",
      "series": "mesilas-yesharim",
      "episode_number": 25,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 24 - This World to the Next",
      "description": "Imagine being crowned king for a year, only to be exiled to a deserted island once your reign ends. What would you do? The Ramchal teaches that life in Olam Hazeh is like a brief kingship, but our true destination is Olam Haba. The question is: are you sending your riches ahead or arriving empty-handed?In this episode, Rabbi Klapper explores the importance of seeing this world as preparation for eternity. How do everyday actions impact our ultimate reward? Why does Olam Haba depend entirely on what we accomplish here? Through relatable stories and powerful Torah insights, this episode will inspire you to focus on what really matters—building a life that ensures your journey to the next world is filled with meaning and lasting impact.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "13-05-25",
      "length": "7.09 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0NTWumTZi6hn4RiasJSKdp",
      "series": "mesilas-yesharim",
      "episode_number": 24,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 23 - Influence on This World",
      "description": "What if even the simplest objects in your life—your table, your phone, or even the rocks beneath your feet—could be elevated through your actions? The Ramchal teaches that Hashem created the world with a purpose: to bring holiness into every aspect of creation. But it’s up to us to make that happen.In this episode, Rabbi Klapper explores the profound impact of human actions on the world. Why did Yaakov Avinu’s stones fight for the chance to support his head? How does using the physical world for mitzvos change its very essence? Through fascinating stories and deep Torah insights, this episode will inspire you to see your surroundings differently. You’ll learn how to transform mundane moments into acts of kedusha that elevate not only yourself but the world around you.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "06-05-25",
      "length": "8.83 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/21BhLeQWhv9RxzYjWdsosi",
      "series": "mesilas-yesharim",
      "episode_number": 23,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 22 - The Tests of This World",
      "description": "Why did Hashem put us in a world filled with distractions? The Ramchal teaches that Olam Hazeh isn’t just a hallway to Olam Haba—it has its own purpose. But here’s the catch: if you use the world incorrectly, it pulls you away from Hashem. If you use it wisely, it brings you closer. So how do we make sure we’re elevating the world instead of getting lost in it?In this episode, Rabbi Klapper explores the delicate balance between enjoying life’s pleasures and staying focused on spiritual growth. What does it mean to elevate the physical world? How can everyday actions become part of your avodas Hashem? Through relatable stories and practical insights, this episode will show you how to see your tests in life not as burdens, but as opportunities to build yourself—and the world—into something higher.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "29-04-25",
      "length": "5.84 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5sHmfBJ9gGBchITJFsXNBV",
      "series": "mesilas-yesharim",
      "episode_number": 22,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 21 - Run Away From the Yetzer Hara",
      "description": "We often hear that life is a battle against the Yetzer Hara, but the Ramchal teaches a surprising truth: the best way to win isn’t to fight—it’s to run. Why wrestle with temptation when you can avoid it altogether? The Torah’s wisdom is clear: don’t put yourself in a situation where you’ll need to fight. Stay far from danger, and you won’t have to fight as hard.In this episode, Rabbi Klapper explores practical strategies to keep the Yetzer Hara at bay. Why is prevention more powerful than confrontation? How do small choices—like avoiding certain streets or limiting distractions—transform our avodas Hashem? Through stories and insights, this episode will inspire you to protect your spiritual growth by creating boundaries that make success in Yiddishkeit easier and more lasting.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "22-04-25",
      "length": "9.18 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/79tvv5C8oLwlLPqwl5t225",
      "series": "mesilas-yesharim",
      "episode_number": 21,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 20 - The Battle of This World",
      "description": "Life is a battle. Whether it’s chasing wealth, struggling with health, or navigating relationships, we all face constant challenges. But the Ramchal reminds us that these battles are by design. Hashem placed us in a world filled with distractions and desires—not to break us, but to refine us. The real question is: Will you stay focused on what truly matters?In this episode, Rabbi Klapper explores the nature of nisyanos—life’s tests—and how they push us to grow. Why do both poverty and wealth bring unique challenges? How do we avoid losing ourselves in the fight for success? Through practical insights and deep Torah wisdom, this episode will guide you toward seeing life’s battles not as obstacles, but as opportunities to become stronger, more connected to Hashem, and truly fulfilled.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "08-04-25",
      "length": "13.39 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5qT9aYhm4cjKjWRRxvbMGk",
      "series": "mesilas-yesharim",
      "episode_number": 20,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 19 - A Deeper Understanding",
      "description": "What is true goodness? We chase happiness and success, but often find ourselves feeling empty. The Ramchal reveals that lasting joy comes from one source—dveikus to Hashem. But how do we achieve that connection? The answer lies in the mitzvos.In this episode, Rabbi Klapper takes you on a journey to uncover a deeper understanding of mitzvos. Why are they the key to both spiritual completion and eternal pleasure? How can physical acts lead to ultimate closeness with Hashem? Through careful analysis and practical insight, this episode will help you rethink your avodas Hashem and see mitzvos not just as obligations, but as opportunities to build a lasting relationship with the Divine.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "01-04-25",
      "length": "6.72 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1Rws7iWww4wmjcpH8hy4GJ",
      "series": "mesilas-yesharim",
      "episode_number": 19,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 18 - The Pursuit of Pleasure",
      "description": "What’s the point of life? The Ramchal answers clearly: Hashem created us to experience the ultimate pleasure. But this isn’t the fleeting enjoyment of good food or material success. It’s the highest form of joy—being close to Hashem. The problem? This world is just the hallway to that eternal pleasure, and too many people spend their time decorating the hallway instead of focusing on what really matters.In this episode, Rabbi Klapper explores how to distinguish between temporary pleasures and lasting fulfillment. Why does Hashem want us to earn our reward instead of giving it freely? How do mitzvos become the building blocks of eternal joy? Through relatable examples and timeless wisdom, this episode will help you focus your efforts on what truly counts—earning a meaningful life and an everlasting connection to Hashem.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "25-03-25",
      "length": "13.06 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/7A42Uy1aXkCGVnhr5V3ubu",
      "series": "mesilas-yesharim",
      "episode_number": 18,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 17 - Clarity of the Purpose of Life",
      "description": "What is your purpose in life? It’s the most important question you’ll ever ask—and one that too many people never answer. The Ramchal teaches that every person must clarify their life’s goal before they can grow spiritually. Without a solid foundation, all efforts to achieve greatness will collapse under pressure.In this episode, Rabbi Klapper guides listeners through the process of identifying their core mission. How do you balance spiritual growth with practical responsibilities? Why is it crucial to establish life priorities before chasing success? Through powerful stories and relatable insights, this episode will help you solidify your foundation in avodas Hashem, ensuring your life is built on a purpose that will stand the test of time.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "18-03-25",
      "length": "12.82 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/57vLhlx4Q4zC6fVAlchMvy",
      "series": "mesilas-yesharim",
      "episode_number": 17,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 16 - Hashem Wants Your Body",
      "description": "Loving Hashem in your heart is important—but it’s not enough. The Ramchal teaches that Hashem doesn’t only want your thoughts and feelings; He wants your actions, too. From shaking a lulav to giving tzedakah, it’s the physical acts of mitzvos that bring holiness into the world.In this episode, Rabbi Klapper explores why Judaism places such a strong emphasis on the body and the physical world. What makes Shabbos meals, bris milah, and honest business practices so spiritually significant? And why do physical mitzvos elevate us in ways that pure intentions cannot? This episode will show you how Hashem calls on us to infuse holiness into every part of life—mind, heart, and body—transforming the ordinary into the extraordinary.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "11-03-25",
      "length": "15.79 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0VEKlZqXoSu2O7fJn9oUOK",
      "series": "mesilas-yesharim",
      "episode_number": 16,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 15 - A Full Heart for Hashem",
      "description": "What does it mean to serve Hashem with a full heart? The Ramchal teaches that shlemus halev—a complete and wholehearted devotion to Hashem—goes beyond performing mitzvos. It means aligning your inner world, your desires, and your intentions entirely with Hashem's will. But how do we achieve such purity of heart when we’re naturally pulled toward self-interest? In this episode, Rabbi Klapper explores the balance between human needs and spiritual aspirations. Is it possible to enjoy the pleasures of life while maintaining pure intentions? How do everyday actions like eating or celebrating become acts of divine service? With relatable stories and practical advice, this episode will guide you on the path to serving Hashem with sincerity and joy, helping you turn even mundane moments into spiritual achievements. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "04-03-25",
      "length": "21.52 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/37wIPyyZW6TvFemQsirCmL",
      "series": "mesilas-yesharim",
      "episode_number": 15,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 14 - Loving Hashem",
      "description": "How do we truly love Hashem? The Ramchal teaches that Ahavas Hashem isn't about grand gestures or bursts of emotion—it's about cultivating a deep, steady relationship. But what does real love mean? And how do we separate love from fleeting feelings of excitement? In this episode, Rabbi Klapper explores the essence of love in avodas Hashem. Why do we instinctively want to make our parents proud, even when it’s hard? And how does that natural drive help us build a relationship with Hashem? Through relatable examples and powerful insights, this episode reveals how to transform mitzvos from obligations into acts of love, bringing meaning and joy into every aspect of your life. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "25-02-25",
      "length": "10.31 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2kYOBd8fIqVkgXMd6UDRYu",
      "series": "mesilas-yesharim",
      "episode_number": 14,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 13 - Walk in His Ways",
      "description": "How do we follow Hashem’s ways when He is infinite and we are human? The Ramchal teaches that “walking in His ways” means refining our midos to mirror His attributes. But improving midos isn’t just about fixing what’s broken—it’s about straightening what’s slightly off and fine-tuning every aspect of our character. In this episode, Rabbi Klapper explores the challenge of aligning our personalities with Torah values. How do we channel natural tendencies into productive avodas Hashem? Why is it dangerous to say, “That’s just the way I am”? And how can each person’s unique traits become tools for bringing more chesed and kiddush Hashem into the world? This episode will help you take control of your nature and make it a force for good, following in Hashem’s ways step by step. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "18-02-25",
      "length": "12.61 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4BDaBRCryyKR7KNXLAdSwm",
      "series": "mesilas-yesharim",
      "episode_number": 13,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 12 - What Does Hashem Want From You",
      "description": "“What does Hashem really want from me?” It's a question we all ask at some point, and Moshe Rabbeinu gives a clear answer in Parshas Eikev: fear Hashem, walk in His ways, love Him, and serve Him with all your heart. But how do these lofty goals translate into practical life? And why do so many people hesitate to take that first step? In this episode, Rabbi Klapper explores the timeless wisdom of the Ramchal, revealing how our purpose in life is spelled out in the Torah—but it’s a long road that requires effort and patience. Through relatable stories and insights, he shows how choosing the “long-short road” may seem harder at first but ultimately leads to true fulfillment. This episode will help you embrace the journey toward becoming the person Hashem wants you to be. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "11-02-25",
      "length": "16.59 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5KlJbN3hFZ6wqeU6h7dotG",
      "series": "mesilas-yesharim",
      "episode_number": 12,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 11 - Use Your Time Right",
      "description": "We all know time is precious—yet we waste so much of it on things that don’t truly matter. The Ramchal challenges us to rethink our priorities: are we investing our time in what’s truly important, or are we letting life slip by while focusing on trivialities? In this episode, Rabbi Klapper explores how Yiras Shamayim—true awe of Hashem—is the ultimate Chochmah, but it requires effort, focus, and consistent work. Why do we spend hours perfecting our careers and hobbies, yet neglect the most vital parts of life? This episode will guide you on how to shift your mindset and use your time wisely, turning each moment into a step toward real growth and self-transformation. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "04-02-25",
      "length": "7.53 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/328FkXVUDKmSBbZwouv09B",
      "series": "mesilas-yesharim",
      "episode_number": 11,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 10 - Like You Are Running After Money!!!",
      "description": "People will go to the ends of the earth for money—but how many chase after Yiras Shamayim with the same intensity? The Ramchal teaches us that the greatest treasure we can pursue is spiritual growth. But unlike wealth, Yiras Shamayim doesn’t come naturally. You have to search for it, work on it, and prioritize it above all else. In this episode, Rabbi Klapper challenges us to rethink what we’re chasing in life. Why do people dedicate their lives to building fortunes but neglect their character? How do our hardest struggles reveal the areas we’re meant to grow in? And what would happen if we pursued personal development with the same energy we put into our careers? This episode will inspire you to shift your focus from fleeting wealth to lasting spiritual riches. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "28-01-25",
      "length": "19.49 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4rMyQmawRnAZInPFoCE3Hw",
      "series": "mesilas-yesharim",
      "episode_number": 10,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 9 - Develop Yourself",
      "description": "What’s your real life’s work—building your bank account or building yourself? The Ramchal reminds us that avodas Hashem isn't just about knowing the right things. It’s about developing our midos and refining our character. Yet, so many people are afraid to look in the mirror and ask, “Am I really the person I should be?” In this episode, Rabbi Klapper takes a deep dive into the process of self-development. Why do so many people face a midlife crisis, feeling empty despite their worldly successes? And how can early investment in personal growth prevent those moments of regret? This episode will inspire you to make your life’s focus your own growth, ensuring that when you look back, you’ll see a life of meaning, not wasted potential. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "21-01-25",
      "length": "11.68 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0GWAiGNsYuAaf0TygHQ5Zo",
      "series": "mesilas-yesharim",
      "episode_number": 9,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 8 - Proper Planning",
      "description": "Why do so many ambitious plans for spiritual growth fail? The Ramchal teaches us that the key to lasting success in avodas Hashem isn’t about how fast we grow but about how wisely we plan. It’s not just about inspiration—it’s about knowing yourself, recognizing your limits, and pacing your efforts to avoid burnout. In this episode, Rabbi Klapper explores practical strategies for personal growth, from using incentives to stay motivated to understanding the dangers of an “all-or-nothing” mindset. How do you balance ambition with patience? And how do you build a plan that works for you? This episode will help you create a sustainable approach to growth, ensuring that your spiritual goals don’t fizzle out. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "14-01-25",
      "length": "7.2 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4XzaOxfDzQNHwNYdQzSrrL",
      "series": "mesilas-yesharim",
      "episode_number": 8,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 7 - Natural Emunah",
      "description": "Ever notice how young children have a pure, unshakable belief in Hashem? That’s because emunah is natural—it’s hardwired into every human soul. Yet as we grow older, cynicism creeps in, clouding this innate faith. Why does this happen? And how can we reclaim the simplicity of belief in a complicated world? In this episode, Rabbi Klapper explores the Ramchal’s profound insight: unlike yirah and ahavah, which require effort to cultivate, emunah is already inside us. But maintaining it requires care—keeping negativity and doubts at bay. Through relatable stories and practical advice, this episode offers a path to nurturing your natural faith and holding onto the clarity that life’s distractions often bury.  Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "07-01-25",
      "length": "8 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3w7BvBBok0NtPYMtvEs0vV",
      "series": "mesilas-yesharim",
      "episode_number": 7,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 6 - Seeing Life’s Crucial Details",
      "description": "This week, we explore the Ramchal’s teachings on sensitivity to life’s details and the transformative power of Mussar in navigating our inner contradictions. Why do we so often overlook the aspects of life that truly matter? How can we shift from living with guilt to embracing a productive path of Teshuva?  Join us as we discuss how learning Mussar provides the clarity and tools to process our struggles, develop resilience, and find purpose in the process of growth. With a focus on practical insights, this episode will inspire you to recognize the significance of details and how they shape your relationship with Hashem and yourself.  Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "30-12-24",
      "length": "5.9 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3u4Dr7wLc3AAxO0OgP4V32",
      "series": "mesilas-yesharim",
      "episode_number": 6,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 5 - What Drives True Avodas Hashem?",
      "description": "In this episode, we explore the deeper meaning of Yiras Shamayim and what it truly means to go beyond the basics in Avodas Hashem. Why do people resist taking on extra responsibilities like chumras, and how can they actually strengthen our relationship with Hashem?  Through the lens of the Ramchal’s teachings, we’ll uncover the power of lifnim mishuras hadin—going above and beyond halachic obligations—not as a burden, but as an opportunity to enhance our spiritual lives. Join us as we reflect on the importance of Mussar, the effort required for growth, and the extraordinary rewards that come with true dedication to Avodas Hashem. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "26-12-24",
      "length": "6.57 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4Qi5o8NkgSkdZaXslND38h",
      "series": "mesilas-yesharim",
      "episode_number": 5,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 4 - Rediscovering Mussar's True Purpose",
      "description": "This episode tackles an age-old question: Why do so many people overlook learning Mussar, even though it’s critical to true spiritual growth? Do we dismiss it as \"too simple,\" or do we assume it’s only for those struggling with other areas of Torah?  Join us as we explore the Ramchal’s call to prioritize Mussar and how it can transform not just our knowledge, but our connection to Hashem and our purpose in life. We'll debunk the myths surrounding Mussar and highlight its universal relevance—whether you're a beginner or a talmid chacham. Together, let’s reclaim the passion and importance of a Mussar seder and bring it back into the heart of our daily Avodah. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "23-12-24",
      "length": "8.75 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1qhixioYibX13hmIFxN9BE",
      "series": "mesilas-yesharim",
      "episode_number": 4,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 3 - Beyond Knowledge: Becoming Better",
      "description": "This week, we explore the Ramchal’s perspective on intellect and its potential for personal transformation. Have you ever wondered why intellectual achievements alone don’t lead to true fulfillment? Why do so many brilliant minds struggle to translate their insights into real personal growth?  Join us as we dive into Mesilas Yesharim and uncover the secret to using your mind—not just for knowledge, but for self-improvement. We’ll challenge the common idea of intellect as a purely external pursuit and show how true wisdom lies in applying what we know to change who we are. Through practical advice and timeless lessons, this episode is perfect for anyone looking to move beyond theory and become their best self. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "19-12-24",
      "length": "7.21 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2iOvzNF1qZElZpEP1tCaag",
      "series": "mesilas-yesharim",
      "episode_number": 3,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep. 2 - From Clear Ideas to Real Change",
      "description": "In this episode, we continue exploring Mesilas Yesharim, uncovering the gap between knowing the truth and living it. Have you ever felt clarity in a shiur or davening but struggled to apply it when faced with real-life challenges? Why is it so hard to transform what we know into how we act?  Join us as we delve into the Ramchal’s timeless guidance on turning intellectual clarity into a lived experience. Through relatable examples and practical advice, we’ll discuss how constant repetition and reflection are the keys to personal growth. This isn’t just about adding more knowledge—it’s about creating lasting change, one small step at a time. Perfect for anyone ready to take their learning to the next level and truly make it real.  Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "16-12-24",
      "length": "5.71 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3a8051JKnWh9SNVPMuALMI",
      "series": "mesilas-yesharim",
      "episode_number": 2,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    },
    {
      "title": "Ep 1 - Remembering What You Already Know",
      "description": "Welcome to the very first episode of the Real Judaism - Mesilas Yesharim podcast series, where timeless Torah wisdom meets real-life application. This week, Rabbi Ari Klapper begins an incredible journey into Mesilas Yesharim, offering insights on how to bring clarity and focus into our Avodas Hashem. Why do we often forget the most important truths, even as we strive to live by them? And how can we take foundational knowledge and make it part of our daily lives? In this introductory episode, you’ll discover how Mesilas Yesharim helps us bridge the gap between what we know and how we live. Whether you’re a seasoned learner or just starting out, this series offers inspiration and tools to deepen your understanding and connection to Torah values. Real Judaism is hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions. For more episodes and resources, visit realjudaism.org. Join us as we embark on a transformative exploration of the principles that form the foundation of a meaningful Jewish life.",
      "date": "14-12-24",
      "length": "7.41 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3yCql5pOVxcH6R3WhW7brx",
      "series": "mesilas-yesharim",
      "episode_number": 1,
      "file_path": "data\\Mesilas Yesharim_episodes.csv"
    }
  ]
}