{
  "episodes": [
    {
      "title": "Ep. 57 – How to Act in Front of the King",
      "description": "If the King were in the room, would you move differently? Speak differently? Touch things more carefully?In this stirring episode, Rabbi Klapper takes us deeper into the reality of Shabbos as a royal encounter. Building on the image of standing lifnei haMelech, we explore why even seemingly minor halachic infractions on Shabbos—like tearing a hangnail or tying a simple knot—are treated with extreme gravity. But the goal isn’t fear—it’s awareness. With vivid mashalim from the Persian court, historical anecdotes, and a moving story about a presidential visit, we learn how kavod (honor) for a human king demands restraint, precision, and presence. So how much more so when we're standing in the home of Hashem?Shabbos isn’t just “a day off.” It’s a kingdom. The palace gates open, and every step we take—from how we dress to how we move our hands—is part of the protocol. The drapes come down, distractions are removed, and we are called to give Hashem our full attention.Because when the King...",
      "date": "11-09-25",
      "length": "26:23",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3PeULPOeIJoqU2XKxAAEDw",
      "series": "shabbos",
      "episode_number": 57,
      "file_path": "data\\Shabbos_episodes.csv"
    },
    {
      "title": "Ep. 56 - Extreme Sensitivity",
      "description": "Ep. 56 – Extreme SensitivityWhat if the most dangerous thing about Shabbos isn’t what you do—but what you ignore? How do we train ourselves to treat Shabbos like we're truly standing before the King?In this urgent and emotionally charged episode, Rabbi Klapper explores the concept of poshe'a—spiritual negligence—and why even unintentional mistakes on Shabbos must be taken seriously. From forgotten Eruv Tavshilin to casually fiddling with muxa, he makes the case that small habits reflect deeper attitudes. Shabbos isn’t just a set of rules; it’s standing lifnei haMelech. Just as a soldier in the king’s guard is judged by the shine of his buttons, we too are judged by our awareness, our preparation, and the kavod we bring into Shabbos. Through halachic sources and striking analogies—like a driver who blames his broken glasses for an accident—Rabbi Klapper teaches us that forgetting isn’t innocent when it becomes a lifestyle.This episode invites you to rethink how seriously you take the “small things”—because when the King is present, nothing is small. Whether it’s how you dress, how you speak, or how you act in private, Shabbos demands our full awareness. And with it, the chance to become who we were meant to be.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "04-09-25",
      "length": "00:33:58",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3GDfM5cwP6oynt7TFmdfYR",
      "series": "",
      "episode_number": 56,
      "file_path": ""
    },
    {
      "title": "Ep. 55 – In the King’s Palace",
      "description": "If Hashem is always everywhere, what makes Shabbos different? Why is it that the same actions done on Friday feel mundane, yet on Shabbos they carry such weight, depth, and holiness?In this rich and powerful episode, Rabbi Klapper deepens our understanding of Shabbos by comparing it to the royal palace of a king. Just as entering the king’s inner court demands heightened reverence, precision, and presence, so too does entering into Shabbos. Drawing from Chazal, halacha, and the physical reality of the Beis HaMikdash, we uncover the core idea: Shabbos is the space where Hashem’s malchus is revealed b’gilu. Not just in theory—but in experience. Rabbi Klapper explains how even if we can’t always feel this, we can act our way into awareness. Clothing, behavior, speech—these aren't empty rituals, they're ways to train ourselves to feel the awe of being in Hashem’s presence. Just as the Beis HaMikdash reshaped the people who entered it, Shabbos can reshape us—if we let it.If you’ve ever wondered how to make Shabbos feel holy—not just look holy—this episode gives you the roadmap. It's not about changing Shabbos. It's about letting Shabbos change you.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "28-08-25",
      "length": "00:26:06",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2wmfuLS0M8DLcnypenQE06",
      "series": "",
      "episode_number": 55,
      "file_path": ""
    },
    {
      "title": "Ep. 54 – Shabbos; A Whole New World",
      "description": "Is Shabbos just a day off—or is it a different world? What if the change from weekday to Shabbos isn't just a shift in schedule, but a total shift in identity, in reality, in malchus?In this eye-opening episode, Rabbi Klapper lays the foundation for a deeper understanding of what it means to live under Hashem's kingship. Drawing parallels between how nations function—with flags, language, clothing, and values—and how Shabbos creates a “spiritual country” of its own, we come to see that Shabbos isn’t one mitzvah among many. It’s a world, with its own culture, rhythm, and leadership. Just as the Jewish people have always maintained their uniqueness—through exile, pressure, and even persecution—Shabbos becomes our weekly declaration: we live in the King's palace. The kedusha of Shabbos isn’t just felt inside; it transforms the streets, the meals, the very air of a Jewish home.This episode invites you to see yourself not just as a Jew who keeps Shabbos—but as a citizen of Shabbos. And once you live in that world, everything looks different—even Monday.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "21-08-25",
      "length": "00:29:52",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2A13rEuzELxoio4tdkebSB",
      "series": "",
      "episode_number": 54,
      "file_path": ""
    },
    {
      "title": "Ep. 53 – The Song of Shabbos",
      "description": "What if the holiest moments are the ones you can’t describe? What if the real entrance to Shabbos isn’t spoken—but sung?The moment Shabbos begins isn’t something you can schedule. It doesn’t arrive when the candles are lit or the seudah is served. It crashes into your world like a wave—silent, sudden, and impossible to prepare for. Rabbi Klapper uncovers why the Torah calls it Mizmor Shir L’yom HaShabbos, beginning with the wordless melody (zimra) before allowing in words (shira). That’s not poetic—it’s halachic reality. The Shechinah enters like the moment of death or the day of judgment: sudden, total, and transformative. No matter how much we prepare, the actual experience of Shabbos is always more than we’re ready for.And yet—we are called to respond. To sing. Not just to float on inspiration, but to translate it into awareness, into action, into change. The song of Shabbos begins where words end, but it cannot stay there. Through rich minhagim, layered metaphors, and the startling honesty of spiritual growth, this episode invites you to enter Shabbos not just as a break from the week—but as a taste of Olam Haba, demanding more from your heart, your voice, and your life.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "14-08-25",
      "length": "00:27:01",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1VMdvSRH8WdKpXXCTaGzKl",
      "series": "",
      "episode_number": 53,
      "file_path": ""
    },
    {
      "title": "Ep. 52 – The Depth of Song",
      "description": "What happens when you feel something so deeply, you can’t even say it out loud? Can a niggun express what words cannot?Some moments of connection to Hashem are so deep, so raw, they escape language. In this episode, Rabbi Klapper opens the gates to Zimra—the wordless tune—and Shira—the articulated song—and shows how both are essential for true avodas Hashem. We explore why Shabbos is the day of song more than any other: each tefillah, each seudah, each moment carries a unique melody, a unique way of expressing something that can’t be said directly. But music alone is not enough. Like a seed that never gets planted, pure emotion without translation into words or actions can fade quickly. It must be rooted in Shira—in words, in thought, in details—if we want it to become real.Drawing from Tehillim, halacha, and a moving analogy from Rav Pinkus, we learn why Shabbos songs matter so much and why they must go beyond performance. They’re not background—they’re transformation. When we sing with kavana, both with and without words, we carry the depth of Shabbos into the rest of our lives.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "07-08-25",
      "length": "00:27:14",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2awID3do0LebZp3KCoQATM",
      "series": "",
      "episode_number": 52,
      "file_path": ""
    },
    {
      "title": "Ep. 51 – Shira and Zimra",
      "description": "Why do we sing on Shabbos? What does music express that words alone never could?In this stirring and soulful episode, Rabbi Klapper opens the door to the world of shira and zimra—two different kinds of song, each with its own power. Shira uses words to praise Hashem, while zimra bypasses speech altogether, expressing a heart so full that no words will do. Through examples from the Beis HaMikdash, the Avodah of the Leviim, and the structure of the Torah itself, we discover that music is not just an accessory to holiness—it’s a gateway. Like a niggun that lifts the soul or a trop that unlocks hidden meaning in the Torah, song connects us to Hashem in a way that reaches beyond thought and straight into the heart.Shabbos, the day when the Shechinah rests in our homes, is also the day of song—because only through melody can we truly express the joy, the gratitude, and the awe of standing in the King’s presence. This episode invites you to listen more deeply—to the words, the notes, and the silence between them.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "31-07-25",
      "length": "00:30:08",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/21RWxYIAyGMseVHOqvxpV2",
      "series": "",
      "episode_number": 51,
      "file_path": ""
    },
    {
      "title": "Ep. 50 – Why Is Shabbos So Machmir",
      "description": "Why does breaking Shabbos carry a more severe punishment than murder? How can a small mistake—a forgotten halacha or a tiny misstep—warrant such a serious response? It seems extreme, even unreasonable—until we ask the deeper question: what is Shabbos?In this piercing and layered episode, Rabbi Klapper leads us on a journey into the heart of kedusha. Drawing stunning parallels between the Beis HaMikdash and Shabbos, we come to see Shabbos not as a list of do’s and don’ts, but as the very center of Hashem’s presence in our lives. Just like a surgeon in the brain must act with total precision, because every millimeter matters, so too Shabbos demands a different level of care. It is the soul’s operating room—the place where the Shechina rests inside us. That’s why even the smallest breach feels so heavy: because it takes place in the holiest space we ever enter. Shabbos is not only like the Kodesh HaKodashim—it is our personal Kodesh HaKodashim. When we treat it that way, with awe and sensitivity, we don’t just avoid punishment—we open the gates to transformation.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "24-07-25",
      "length": "00:27:23",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3fGJUlN3LWFC8alQzaPErj",
      "series": "",
      "episode_number": 50,
      "file_path": ""
    },
    {
      "title": "Ep. 49 – A Good Smell on Shabbos",
      "description": "Why does the Torah highlight the prohibition of fire—but not of smell—on Shabbos? And why does a fragrance have the power to shift the atmosphere of a home? We’re used to thinking of smells as trivial—nice, maybe—but not spiritual. But Chazal, the Zohar, and even the Ketores say otherwise.Rabbi Klapper takes us deep into the quiet power of reach tov, showing how scent is more than perfume—it’s presence. In the Beis HaMikdash, the ketores didn’t just make things smell nice; it announced that the Shechina was welcome. And in our homes, the smell of food, flowers, and warmth becomes a defense against kas—anger—and against the fire the Satan loves to light on Erev Shabbos. That’s why Chazal say don’t light a fire in your homes—not just a physical one, but the emotional kind too. This episode explores how to protect your Shabbos atmosphere, build shalom bayis, and make your home a place the Shechina wants to enter. Because yes, holiness can be smelled.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "17-07-25",
      "length": "00:30:25",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5gxkSB3iJty672FQVyriho",
      "series": "",
      "episode_number": 49,
      "file_path": ""
    },
    {
      "title": "Ep. 48 – The Holiness of Food",
      "description": "Can eating be a spiritual act? Can a piece of challah or kugel bring you closer to Hashem? We know that korbanos in the Beis HaMikdash were holy—but what if your Shabbos table could be just as powerful?Rabbi Klapper guides us through the hidden kedusha of food on Shabbos. Drawing powerful parallels between the eating of korbanos by the Kohanim and our Shabbos seudos, we discover that food isn’t just nourishment—it’s connection. When prepared and eaten l’kavod Shabbos, even a simple dish becomes an offering on Hashem’s table. Through stories of Esther HaMalka, Yitzchak Avinu, and insights into the halachos of clothing, mikvah, and the scent of the ketores, we uncover the secret: Shabbos meals are a spiritual experience when rooted in shalom bayis and kavod Shabbos. Hashem repays the cost—and rewards the intention. Your dining room can become a mikdash, if you bring the right kavod and peace to the table.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "10-07-25",
      "length": "00:29:33",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/17UHSvbQaAuBTXMAtpMFRv",
      "series": "",
      "episode_number": 48,
      "file_path": ""
    },
    {
      "title": "Ep. 47 – Menorah, Shulchan, and Atonement on Shabbos",
      "description": "Can a table bring you closer to Hashem? Can a candle bring you atonement? If the Beis HaMikdash was all about sacrifices, what do Shabbos candles and challah have to do with it? And why does simply saying “Vayechulu” on Friday night carry the power of a korban?This episode reveals how Shabbos mirrors the Beis HaMikdash in astonishing ways. The menorah becomes the Shabbos candles, the shulchan becomes the Shabbos table, and the korban tamid becomes the Vayechulu we recite each week. But the goal isn’t ritual—it’s reconnection. When we light candles, prepare the table, and declare Hashem’s mastery over creation, we’re not just remembering the Mikdash—we’re rebuilding it. Rabbi Klapper shows how each detail, even the number of challahs, echoes the sacred service of the Kohanim. Shabbos isn’t a substitute for the Mikdash. It’s a weekly Mikdash we step into with open eyes and full hearts.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "03-07-25",
      "length": "00:25:50",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/38xNyFeZ2FkmyyJvfLidTS",
      "series": "",
      "episode_number": 47,
      "file_path": ""
    },
    {
      "title": "Ep. 46 - Shabbos and Tisha B'Av",
      "description": "Tisha B’Av is the darkest day of the year, filled with mourning and loss. Shabbos is the holiest day, filled with joy and connection. But what happens when Tisha B’Av falls on Shabbos? Why do we treat it like any other Shabbos—full of food, song, and celebration? Is this just a technicality, or is something much deeper happening?Rabbi Klapper reveals the secret connection between Shabbos and Tisha B’Av: Shabbos is a living Beis HaMikdash. While Tisha B’Av forces us to face the destruction of the Mikdash and the Shechina’s absence, Shabbos brings that Shechina back, making it real again. This episode explores why Shabbos doesn’t just push away Tisha B’Av—it actually fixes it. When Shabbos arrives, the Shechina is here, and the Mikdash is restored. But how can we truly feel that Shechina in our lives? And what can we do to experience Shabbos as a day of divine presence, even in a world still in exile?Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "26-06-25",
      "length": "25.45 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4PkzeEvXcVGZF8bsmCja91",
      "series": "",
      "episode_number": 46,
      "file_path": ""
    },
    {
      "title": "Ep. 45 - Like the Beis Hamikdash",
      "description": "If we long for the Beis HaMikdash, where Hashem’s presence was felt so powerfully, what do we have now? Is Shabbos just a taste of what was lost, or is it something even more powerful?Shabbos isn’t just a memorial of the Mikdash—it is a Mikdash in time. Just as the Beis HaMikdash was the place where the Shechina rested, Shabbos is the time where that presence is felt without walls, without barriers. Rabbi Klapper reveals how the Kedusha of Shabbos transforms our homes into mini Beis HaMikdash. But if Shabbos is so holy, why don’t we feel it? What’s the secret to experiencing the Shechina in your home every week? Learn how treating Shabbos like a Mikdash can transform your experience and bring true divine connection into your life.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "19-06-25",
      "length": "23.99 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0bemfrKER9CTN4FFArajaj",
      "series": "",
      "episode_number": 45,
      "file_path": ""
    },
    {
      "title": "Ep. 44 - Shabbos, Tefillin, and the Beis Hamikdash",
      "description": "If the Beis HaMikdash was the channel for all bracha in the world, what do we have now that it’s gone? How can we still experience that connection to Hashem’s presence without a physical Mikdash?Shabbos is our living Beis HaMikdash. Just as the Beis HaMikdash was the place where Hashem’s Shechina rested, Shabbos is the time where that presence is felt in our lives. Rabbi Klapper reveals how Shabbos takes the role of the Mikdash, becoming the channel through which all shefa (blessing) enters our world. Why is Shabbos called “Mikdash B’Zman”—a sanctuary in time? What does it mean to enter Shabbos as though stepping into the Kodesh HaKodashim? And how does this change the way we prepare, experience, and leave Shabbos each week? Discover how to turn your home into a Beis HaMikdash every week, and how Shabbos is far more than a day of rest—it’s a day of divine connection.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "12-06-25",
      "length": "25.59 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0ScddODryIjZR71hqUPjP5",
      "series": "",
      "episode_number": 44,
      "file_path": ""
    },
    {
      "title": "Ep. 43 - Shabbos and Tefillin",
      "description": "If Shabbos is an ois (a sign) and Tefillin is also an ois, why don’t we wear Tefillin on Shabbos? Isn’t more holiness better? But there’s a deeper truth: Shabbos itself is a living Tefillin. Just as Tefillin ties Hashem’s name to our head and heart, Shabbos binds us directly to Hashem’s presence without needing physical reminders.In this episode, Rabbi Klapper explores the profound connection between Shabbos and Tefillin. Why is Tefillin hidden inside black boxes, while Shabbos is an open, radiant experience? What is the purpose of the mechitzos (barriers) that make Tefillin possible, and how do they reveal a secret about how we experience Hashem’s light? Through the lens of Kabbalah and powerful stories, we discover why Shabbos is the highest form of attachment to Hashem—an ois so powerful that it doesn’t need any other symbol. If you’ve ever wondered why Shabbos feels different, this episode will show you how it’s a day of direct connection to Hashem—like wearing Tefillin on your soul.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "05-06-25",
      "length": "23.26 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1z0Tm8viXXd5esIcXDyt2s",
      "series": "",
      "episode_number": 43,
      "file_path": ""
    },
    {
      "title": "Ep. 42 - A Complete Rest",
      "description": "Rest isn’t just about taking a break. If it were, then any lazy afternoon could be called Menucha. But Shabbos Menucha is different—it’s a complete disconnection from the world’s chaos, a retreat into the shade of Hashem’s presence. Why does true Menucha mean letting go completely? And what does it look like to trust Hashem so fully that even your worries disappear?This episode explores the essence of Menucha Sheleima, a rest that is more than physical relaxation—it’s an active, spiritual surrender. Rabbi Klapper reveals how the highest form of Menucha is the one Hashem desires for us, where we stop relying on our own efforts and allow ourselves to be held by Hashem’s protection. Through the powerful story of a family who found joy on Shabbos even in the face of tragedy, we learn how complete trust can transform everything. True Menucha isn’t just about peace—it’s about choosing Hashem over everything else.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "29-05-25",
      "length": "30.96 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/23lW028cV2WU1JkU8g7ZlL",
      "series": "",
      "episode_number": 42,
      "file_path": ""
    },
    {
      "title": "Ep. 41 - A True Rest of Emunah",
      "description": "When things are calm, emunah is easy. But what happens when the world around you shakes? Can you still say “Ein Od Milvado” with confidence? And how do you find peace when everything seems uncertain?This episode explores the essence of emunah on Shabbos—Menuchas Emes U’Muna, a rest rooted in unshakeable trust. Rabbi Klapper reveals how Shabbos is the day we step back and recognize that everything is in Hashem’s hands. But this isn’t just about being passive; it’s about living with a calm that comes from knowing that even when you aren’t in control, Hashem is. Through powerful insights and stories, we’ll see how this emunah transforms anxiety into tranquility, making Shabbos a day of true peace, not just physical rest.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "22-05-25",
      "length": "31.29 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/7ae7xP7SbU3Y9lrlrVr4U1",
      "series": "",
      "episode_number": 41,
      "file_path": ""
    },
    {
      "title": "Ep. 40 - Shabbos and the Avos",
      "description": "How the Avos Experience ShabbosAvraham rejoices, Yitzchak sings, and Yaakov rests. But what does that mean? Why do we mention the Avos in Mincha of Shabbos, each with a different reaction? And what do their middos teach us about the deeper essence of the day?Avraham, the embodiment of chesed, sees Shabbos as a flood of divine generosity—Mekor HaBracha—and rejoices in its abundance. Yitzchak, the pillar of gevurah, understands that true Shabbos menucha is about discipline, about channeling everything back to Hashem, so he sings in recognition. But Yaakov, the bechir haAvos, experiences Shabbos in its fullest form—pure menucha, where all physicality is elevated and the material world itself becomes ruchniyus. This is why Shabbos is described as the Nachalas Yaakov, a limitless inheritance that transcends all boundaries. By delving into the unique way each Av connects to Shabbos, we uncover not just their greatness, but how we, too, can elevate our Shabbos in deeper, more profound ways.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "15-05-25",
      "length": "27.98 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3Npfe5UYQGNkMwv5oQupwL",
      "series": "",
      "episode_number": 40,
      "file_path": ""
    },
    {
      "title": "Ep. 39 - The True Source of Our Salvation",
      "description": "Where Does Salvation Really Come From?When we’re in tzarah, where do we turn? Do we rely on political leaders, financial security, or sheer strategy? If Hashem controls everything, why does hishtadlus seem so necessary? And if nature is just an illusion, what does that mean for the way we face challenges?Shabbos reveals the ultimate yeshuah—the realization that Hashem is not bound by nature. There are no rules He must follow, no limits to what He can change. That understanding alone is the greatest salvation a person can have. The Nefesh HaChaim teaches that a person who truly internalizes Ein Od Milvado—that Hashem is the only reality—becomes untouchable. The Brisker Rav’s unshakable calm when walking past Nazi soldiers, the dibbuk story that left Reb Elchonon Wasserman forever changed—these aren’t just miracles, they’re a shift in perspective. This episode explores how Shabbos itself is the gateway to true bitachon and why tapping into it can change everything.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "08-05-25",
      "length": "27 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4HWzywg6nqpDeafmOPj8H1",
      "series": "",
      "episode_number": 39,
      "file_path": ""
    },
    {
      "title": "Ep. 38 - Spending Money for Shabbos",
      "description": "Does Hashem Pay Your Bills?Shabbos is Hashem’s day, but does that mean He covers the cost? Chazal tell us “הלווני ואני פורע”—spend for Shabbos, and Hashem will pay you back. But how far does this go? Should we go into debt for a lavish seudah? Does this mean we can indulge in anything as long as it’s LeKavod Shabbos?This episode uncovers the deeper meaning behind spending for Shabbos. Is the money truly for Hashem’s kavod, or is it about personal indulgence? The difference is everything. Through powerful insights, we’ll explore how Shabbos transforms us into royalty—not just in our meals and clothing, but in our mindset. Why do even the simplest Jews dress like kings on Shabbos? How does spending for Shabbos reveal our emunah? And what happens when we lose sight of what oneg Shabbos really means? Discover how to elevate your Shabbos spending, ensuring that every expense strengthens your connection to the King’s table.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "01-05-25",
      "length": "32.42 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2W6Q5MAc7Ew9VYg8ZLpipc",
      "series": "",
      "episode_number": 38,
      "file_path": ""
    },
    {
      "title": "Ep. 37 - The One True Nation",
      "description": "What Makes Us One Nation?What truly unites Klal Yisrael? Is it shared history, customs, or culture? If so, why do so many other nations with common roots fall apart while Klal Yisrael remains one people—through exile, persecution, and time?We explore the deep achdus of Klal Yisrael—an achdus that is revealed most powerfully on Shabbos. Just as Shabbos declares Hashem’s oneness to the world, it transforms Klal Yisrael into a Goy Echad Ba’aretz, a people united not just by ancestry, but by their connection to Hashem. Shabbos is not just a gift—it’s the force that makes us a nation. Why does the tefillah of Atah Echad appear only at Mincha? How does Shabbos bring out our neshama’s deepest truth? And what does the Berditchever Rebbe’s famous insight reveal about Klal Yisrael’s unwavering loyalty to Hashem? This episode unpacks the power of achdus and why our nation’s strength is found not in numbers, but in something far greater.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "24-04-25",
      "length": "38.08 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/16QS7pMOseK8EzcuAVq2Ep",
      "series": "",
      "episode_number": 37,
      "file_path": ""
    },
    {
      "title": "Ep. 36 - True Rest is Connecting to Hashem",
      "description": "What Does It Mean to Truly Rest?If Hashem \"rested\" on Shabbos, why does Chazal say He’s been mezaveg zivugim—making matches—ever since? And if Shabbos is a day of rest, why does it demand chiddush, new insights in Torah? Is Menucha just stopping work, or is it something much deeper?This episode, reveals how true Menucha isn’t about inactivity—it’s about reconnecting to the source of life. Just as Hashem continues to create in a different way, Shabbos is about shifting from physical work to spiritual renewal. Through powerful insights from Chazal, we’ll see why learning Torah on Shabbos isn’t a contradiction to rest—it is rest. And how the more we engage in Torah, the more we align our minds with Hashem’s mind, forging the deepest connection possible. If you’ve ever wondered why Shabbos feels different but couldn’t put it into words, this episode will help you understand what’s really happening when the world stops and the Shechina arrives.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "03-04-25",
      "length": "33.89 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3jnndCLjOGtPxAankhzw21",
      "series": "",
      "episode_number": 36,
      "file_path": ""
    },
    {
      "title": "Ep. 35 - Physical and Spiritual Rest",
      "description": "Are You Resting or Just Killing Time?Is Shabbos just a day off, a break from work? Or is there something deeper we often miss? If Menucha means rest, why does Chazal say Shabbos was given for learning Torah—something that takes effort? And if we’re meant to rest, why was an entire city destroyed just for playing ball on Shabbos?In this episode, Rabbi Klapper uncovers the real meaning of Menucha—not just stopping, but recharging. True rest isn’t just avoiding work; it’s about plugging into our ultimate life source, Ruchniyus. The more we connect to Torah and Hashem, the more energy we gain. But when we turn Shabbos into a day of just \"passing time,\" we drain the very power it's meant to give us. Through striking examples, we’ll see why Shabbos isn’t about doing nothing—it’s about doing something real. If you’ve ever walked away from Shabbos feeling physically rested but spiritually empty, this episode will change the way you approach the holiest day of the week.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "27-03-25",
      "length": "27.68 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5JWCx3rkPOgccHLgwO6fu5",
      "series": "",
      "episode_number": 35,
      "file_path": ""
    },
    {
      "title": "Ep. 34 - Recharging our True Batteries",
      "description": "What Really Recharges You?We talk about \"recharging our batteries\" all the time—but what does that really mean? Is it just getting more sleep, taking a break, or disconnecting from work? If so, why does Shabbos Menucha feel different than any other kind of rest?Shabbos isn’t just a day off—it’s a return to our true power source. Rabbi Klapper unpacks the deep connection between Menucha and Ruchniyus, showing how stepping away from Gashmiyus isn’t just about stopping work—it’s about reconnecting with the life-giving force of the world. Just like Hashem \"rested\" by withdrawing from creation, we recharge by moving away from the physical and immersing ourselves in Shabbos. But here’s the paradox: on Shabbos, even Gashmiyus itself is transformed. Eating, sleeping, and even enjoying food take on an entirely new meaning. What’s the secret ingredient that makes Shabbos meals taste different? Why does the Shechina come down to this world, instead of pulling us up? Discover how Shabbos doesn’t just give you a break—it redefines what real life actually is.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "20-03-25",
      "length": "23.88 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0tZx7xdxGNIi2pFPFVorrp",
      "series": "",
      "episode_number": 34,
      "file_path": ""
    },
    {
      "title": "Ep. 33 - What is Menucha?",
      "description": "Are You Really Resting on Shabbos?When we think of Menucha, we imagine a nap, a break from work, or finally slowing down. But is that what Shabbos rest really means? If so, why does the tefillah of Atah Echad speak of Menucha as something deeper—Menuchas Ahava, Menuchas Emes Ve’emuna?This episode challenges everything we assume about Menucha. True rest isn’t about stopping work—it’s about reconnecting to the source of life. When we exhaust ourselves in physicality, we become disconnected from our neshama, leaving us drained. That’s why Shabbos Menucha isn’t just about sleep; it’s a return to our spiritual core, a moment when the Shechina gives us the strength we’ve lost during the week. Through a powerful analysis of Chazal, Rabbi Klapper reveals how Menucha is not just a break—it’s the deepest experience of vitality we can have. If you’ve ever felt physically rested yet spiritually empty, this shiur will open your eyes to what true Menucha really is.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "13-03-25",
      "length": "25.4 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/54zvSmrWa3TzJy2KSY6MW5",
      "series": "",
      "episode_number": 33,
      "file_path": ""
    },
    {
      "title": "Ep. 32 - Welcoming in Shabbos",
      "description": "We don’t welcome Pesach. We don’t welcome Tefillin. So why do we welcome Shabbos? Why do we sing to it, escort it, and refer to it as a guest? What makes Shabbos so fundamentally different from any other mitzvah?Shabbos isn’t just a mitzvah—it’s an encounter with the Shechina. Rabbi Klapper unpacks the depth behind Kabbalas Shabbos, showing how it mirrors Matan Torah, where Klal Yisrael insisted, “We want to see our King!” Just like at Har Sinai, where we had to prepare, dress properly, and stand ready, Shabbos demands that same level of kavod. But are we actually prepared for this moment? Do we race into Shabbos last-minute, treating it as a break from work rather than a royal event? With powerful analogies and halachic insights, this episode explores the true meaning of greeting the Shechina—and why treating Shabbos as just another mitzvah misses the entire point.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "06-03-25",
      "length": "36.12 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/28qDdPrjLH2S8L5tGJ2PT1",
      "series": "",
      "episode_number": 32,
      "file_path": ""
    },
    {
      "title": "Ep. 31 - Erev Shabbos Nap",
      "description": "The Secret to a True ShabbosIf Shabbos is a time of unparalleled Kedusha, why do so many people feel disconnected when it finally arrives? You’ve set the table, the candles are ready, the food is prepared—but is that enough? The answer lies not just in what we do before Shabbos, but in how we prepare ourselves to truly receive it.In this episode, Rabbi Klapper unpacks the deep significance of Erev Shabbos preparations—not just as physical tasks, but as a spiritual avodah. Unlike other mitzvos, where our actions bring Kedusha into the world, Shabbos is different: Hashem brings the Shechinah to us. But if we aren’t ready to greet Him, what happens then? Through powerful analogies—imagine a chassan arriving at an empty wedding hall—he shows how anticipation shapes our experience. And what about the controversial Erev Shabbos nap? Is it just a luxury, or an essential way to ensure we honor Shabbos with full presence? Join us as we uncover the key to feeling the holiness of Shabbos instead of just going through the motions.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "27-02-25",
      "length": "25.85 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/75J94uxto4m0ZwAzCD3IEI",
      "series": "",
      "episode_number": 31,
      "file_path": ""
    },
    {
      "title": "Ep. 30 - Importance of Preparing for Shabbos",
      "description": "Why does the Torah emphasize preparing for Shabbos when Shabbos itself is a gift?In this episode, Rabbi Klapper uncovers the profound significance of Erev Shabbos preparations, teaching us how the effort we invest before Shabbos shapes our connection to its Kedusha. Drawing from classic Torah sources, we’ll explore the deeper meaning behind “Mi she’meichin b’Erev Shabbos, yochal b’Shabbos,” showing how our physical and spiritual preparations pave the way to experiencing Shabbos as a taste of Olam Haba.Through engaging analogies, like the process of earning bracha in this world, and poignant lessons from Chazal, we learn that Shabbos doesn’t just happen—we must actively desire and prepare for it. Tune in to discover how even the smallest acts on Erev Shabbos transform a mundane Friday into the gateway to divine connection.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "20-02-25",
      "length": "27.33 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2JQKNt9HwvPkCQhEnbXZEa",
      "series": "",
      "episode_number": 30,
      "file_path": ""
    },
    {
      "title": "Ep. 29 - Accept the Gift",
      "description": "If Shabbos is a gift from Hashem, do we really need to do anything—or should we just sit back and receive it?Shabbos is unlike any other day. While Yom Tov’s holiness comes from our mitzvos—our ability to bring down kedusha through action—Shabbos is entirely different. The kedusha of Shabbos comes directly from Hashem. It exists whether or not we recognize it. So what, then, is our role? Do we simply stand by, passive observers of Hashem’s great gift? In this episode, Rabbi Klapper explores the active mitzvah of Zachor es Yom HaShabbos, the fundamental avodah of remembering and recognizing Shabbos. He reveals how the key to experiencing true Shabbos isn’t in creating kedusha, but in opening our hearts and minds to accept it.But here’s the real challenge: How many of us actually open this gift? Are we like a child who receives a priceless present and spends all day playing with the box? Do we treat Shabbos like a day off, rather than a gateway into Hashem’s presence? Through deep analysis, stories, and practical insights, Rabbi Klapper explains how training our minds to truly remember Shabbos—not just intellectually, but emotionally and spiritually—transforms the entire day. He shares powerful tools to integrate Shabbos-consciousness into our daily lives, from the way we prepare for Shabbos to how we experience it in real time. Join us for a thought-provoking journey into the essence of Shabbos, and discover how even a small shift in perspective can unlock an entirely new level of connection with Hashem.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "13-02-25",
      "length": "29.87 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1u0RNVP5QIjJWsVWXX6bZh",
      "series": "",
      "episode_number": 29,
      "file_path": ""
    },
    {
      "title": "Ep. 28 - The Holiness of Shabbos",
      "description": "What if holiness wasn’t something you had to create—but something that simply arrived, overwhelming everything in its path?Every Yom Tov, every kedusha we experience throughout the year, is something we bring into the world through our actions. Eating matzah on Pesach, sitting in a sukkah, hearing the shofar—each mitzvah brings down the kedusha of the day. But Shabbos is entirely different. Shabbos is not something we make holy—it is holiness itself. It doesn’t wait for us to sanctify it; it simply arrives, and our only job is to step into it. Rabbi Klapper takes us on a deep journey, showing how the kedusha of Shabbos isn’t like the kedusha of Eretz Yisrael or the Beis HaMikdash—both of which were created by human actions. Shabbos is a revelation, a direct gift from Hashem, the ultimate invitation into His world.But if Shabbos is a gift, why do so many people struggle to feel its power? How can we tap into this kedusha that is beyond our reach? Through fascinating comparisons to nevuah—especially the unique nevuah of Bilam—Rabbi Klapper explains how Shabbos is the “aspaklaria hame'ira,” the clear window through which Hashem enters the world. We’ll explore why the natural world itself keeps Shabbos, why Gehenom stops burning, why even a river changes its course, and what this all means for our personal avodah. Tune in for a transformative discussion that will change the way you experience Shabbos forever.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "08-02-25",
      "length": "27.92 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1fIpz07pXqyHdZdRi9lwZe",
      "series": "",
      "episode_number": 28,
      "file_path": ""
    },
    {
      "title": "Ep. 27 - Build up the Connection",
      "description": "How do you make a meaningful request to someone you barely know? Shabbos is a time when Hashem invites us into His home—a day to strengthen our connection with the Creator. Yet, instead of asking for our personal needs during Shabbos Tefillos, we focus on praising Hashem and recognizing His greatness. Why is that? Rabbi Klapper shares a fascinating insight into the deeper purpose of Shabbos prayers, using the analogy of a fundraiser who builds a friendship before making a request. Through compelling stories and classic sources, discover how Shabbos Tefillah transforms our relationship with Hashem. When we dedicate Shabbos to building that connection, it opens the gates for bracha throughout the week. Join us as we explore how a personal bond with the Divine leads to transformative changes in our lives, one prayer at a time.   Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "30-01-25",
      "length": "32.65 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5UcDDMj3sT0SuYL28ixcTY",
      "series": "",
      "episode_number": 27,
      "file_path": ""
    },
    {
      "title": "Ep. 26 - Power of Prayer to Change the World",
      "description": "Why don’t we ask for personal needs in the Shabbos Tefillos—when it’s the most powerful day to change our fate? Tefillah is rooted in the belief that Hashem can change the unchangeable. Yet, on Shabbos, when we stand at the pinnacle of divine connection, we don’t make requests for health, parnassah, or personal salvation. Why is that? Rabbi Klapper takes us on a deep dive into the essence of Tefillah and its relationship to Shabbos. We’ll explore how Tefillah affirms our belief in Yesh Me'ayin—the ability of Hashem to overturn natural laws—and how this power reaches its peak on Shabbos. Through stories of the Avos, Chizkiyahu, and even modern miracles, we’ll uncover how Shabbos Tefillos reveal our ultimate purpose: not to focus on our needs, but to proclaim Hashem’s glory and bask in His presence. Tune in for a mind-opening discussion on the transformative nature of Tefillah and how it can redefine your connection to Shabbos.  Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "23-01-25",
      "length": "33.9 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6AN05VeWbKVRWjMnENUbbJ",
      "series": "",
      "episode_number": 26,
      "file_path": ""
    },
    {
      "title": "Ep. 25 - Connection of Love",
      "description": "What if you received the most precious gift… and had no idea how to use it? Shabbos is more than just halachos and dinim—it’s a bris ahava, a covenant of love between Hashem and Klal Yisrael. But like any gift, its true value is only felt when we recognize what it means. Rabbi Klapper explores the deep symbolism behind Shabbos, showing how it’s not just about keeping rules but about embracing a relationship. Through stories of Avraham Avinu, Nimrod, and the unique connection of Shabbos as a private conversation between the King and His people, we learn how love can't be forced—it must be reciprocated. Join this thought-provoking journey to discover how we can transform Shabbos from a burden into the ultimate expression of divine love, and how even the simplest acts can deepen that bond.  Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "16-01-25",
      "length": "32.73 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6HQxnYV24gg3IPbS0l6EHY",
      "series": "",
      "episode_number": 25,
      "file_path": ""
    },
    {
      "title": "Ep. 24 - Connecting to Hashem with Our Body",
      "description": "Why does Shabbos remain an exclusive treasure, gifted solely to Klal Yisrael? From the river Sambation to the cosmic secrets of Yesh Me’ayin, this episode unravels how Shabbos serves as more than a commemoration of creation—it is a covenant, a profound sign of love between Hashem and His chosen people. Rabbi Klapper explores the dual dimensions of Shabbos: its universal sanctity embedded in creation and its intimate role as a unique gift for Klal Yisrael. With sharp analysis and warmth, he builds a layered understanding, delving into deep Torah sources and timeless insights. Join us on a journey to uncover why Shabbos transcends natural law and what it reveals about our eternal connection to the Divine. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don't forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "09-01-25",
      "length": "32.47 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2v0uE5Kbu9NQltVuqq5IVW",
      "series": "",
      "episode_number": 24,
      "file_path": ""
    },
    {
      "title": "Ep. 23 - Shabbos, The Foundation of Belief",
      "description": "What makes Shabbos so unique? Shabbos is more than a day of rest—it’s a declaration of trust in Hashem’s creation. But why is refraining from work such a profound statement? And how does it connect us to the very essence of the world’s beginning? Rabbi Klapper delves into these questions, revealing the spiritual depth of Shabbos as a day that transcends the natural order. This episode explores the profound message of being mevatel the world through rest, highlighting the contrast between a Jew’s connection to the Chiddush of Yesh Me’ayin and the limitations of secular perspectives. Through halachic insights, Torah sources, and relatable examples, listeners will uncover how Shabbos redefines our understanding of creation, faith, and purpose. Discover why this holy day stands at the foundation of true emunah and what it means to live above nature. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "02-01-25",
      "length": "31.82 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3G8U7OavfFfy1lgT6ltvC1",
      "series": "",
      "episode_number": 23,
      "file_path": ""
    },
    {
      "title": "Ep. 22 - Trusting Hashem in a World of Work",
      "description": "This week, we uncover the profound message of Shabbos as a day of complete surrender to Hashem’s control. What does it mean to truly rest—not just physically, but with full trust that Hashem runs the world? Why is resting on Shabbos the ultimate declaration of Emunah and connection to the Creator? In this episode, we explore the insights of the Sefer Shabbos Malchusa, revealing how the act of stepping back from work on Shabbos is a proclamation of faith that everything is in Hashem’s hands. Through fascinating stories and deep discussions, we’ll see how Shabbos is not just a day of relaxation, but a time to transcend the natural order and affirm that Hashem’s presence governs our lives. Join us as we examine how embracing Shabbos transforms our relationship with the world, shifting from worry and effort to trust and tranquility. This episode will inspire you to enter Shabbos with renewed confidence, knowing that Hashem provides everything we truly need. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "26-12-24",
      "length": "30.15 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4FUv9x73t2oZd5ePh4b8zG",
      "series": "",
      "episode_number": 22,
      "file_path": ""
    },
    {
      "title": "Ep. 21 - The Art of Trusting Hashem",
      "description": "This week, we explore the extraordinary relationship between Emunah and Shabbos. How can we strengthen our Emunah in a world filled with distractions? What does it mean to trust Hashem fully, not just with our minds but with our actions? Through the profound teachings of the Sefer Shabbos Malchusa, we uncover how Shabbos is a weekly opportunity to stop, reflect, and acknowledge Hashem as the source of everything. Using vivid examples, like the unmatched harmony of nature and the mystery of the Jewish people's survival, we’ll see how Emunah is not a feeling but the intellectual clarity of seeing truth as it is. Join us as we delve into the practical ways Shabbos helps us internalize Hashem’s presence, bringing peace to our lives and aligning us with the ultimate purpose of creation. This episode will inspire you to embrace Shabbos as a time of trust, connection, and true spiritual vision. Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
      "date": "19-12-24",
      "length": "32.54 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0xMw3yNfOOSSQbJZGX1gUl",
      "series": "",
      "episode_number": 21,
      "file_path": ""
    },
    {
      "title": "Ep. 20 The Power of Teshuva",
      "description": "This week, we'll delve deeper into the profound mechanics of how Hashem's justice operates in our world. Have you ever contemplated why certain actions seem to persist against His will, only to be dramatically reversed later? Through a fascinating analysis of the concept of retroactive undoing, we'll discover how both divine judgment and teshuva don't merely correct or compensate - they can actually rewrite spiritual reality itself. Join us as Rabbi Klapper unveils the deeper dimensions of how Hashem's unity demands that ultimately, nothing can truly stand against His will. Through an extraordinary story of a nobleman's teshuva and a compelling analysis of the Gemara's view on mamzeirus, we'll explore how even seemingly permanent spiritual damage can be completely undone. This understanding transforms our perspective not just on historical events like Yetzias Mitzrayim, but on our own capacity for complete spiritual renewal through teshuva.",
      "date": "12-12-24",
      "length": "33.59 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2kzB7nQawjfUDpeR1F7tPK",
      "series": "",
      "episode_number": 20,
      "file_path": ""
    },
    {
      "title": "Ep. 19 The Secret of Hashems Vengeance",
      "description": "This week, we'll explore the profound paradox of Hashem's relationship with the physical world He created. Have you ever wondered how the Creator of all rules and boundaries remains entirely free from their constraints? Through a deep analysis of Shabbos's message, we'll discover how understanding Hashem's limitless nature transforms our perspective on everything from natural law to spiritual growth.Join us as Rabbi Klapper illuminates the fundamental difference between physical boundaries and divine power. By examining how Hashem stands beyond the very rules He established for creation, we gain a revolutionary understanding of true freedom and limitation. This insight doesn't just change how we view the cosmos - it reshapes our entire approach to serving Hashem and understanding our own spiritual potential.Check out: https://realjudaism.org/32p25jfn",
      "date": "05-12-24",
      "length": "28.06 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1DWjViP7f38fzdzkkxhnog",
      "series": "",
      "episode_number": 19,
      "file_path": ""
    },
    {
      "title": "Ep18. The Root of the Fear of Hashem",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "22-11-24",
      "length": "32.62 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/7csImig2VtjIjql1Deb1M6",
      "series": "",
      "episode_number": 18,
      "file_path": ""
    },
    {
      "title": "Ep17. Ein Od Milvado!",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "15-11-24",
      "length": "30.92 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6wvVEgNPPH9kw4flJxuMRL",
      "series": "",
      "episode_number": 17,
      "file_path": ""
    },
    {
      "title": "Ep16. Hashem is Here!!",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "08-11-24",
      "length": "32.05 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6slBdDb00xK7kW8GYik3bC",
      "series": "",
      "episode_number": 16,
      "file_path": ""
    },
    {
      "title": "Ep15. Foundation of Emunah",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "17-10-24",
      "length": "27.59 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2BmknR9y8pDOWhWIRQ6xb9",
      "series": "",
      "episode_number": 15,
      "file_path": ""
    },
    {
      "title": "Ep14. Shabbos, Creation from Nothing",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "27-09-24",
      "length": "27.69 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5RuelfESzN4T7drewPFmja",
      "series": "",
      "episode_number": 14,
      "file_path": ""
    },
    {
      "title": "Ep13. Hashem is the Heart of the Jewish People",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "20-09-24",
      "length": "21.48 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6g7sD8E60dcWt3ngtBSEAf",
      "series": "",
      "episode_number": 13,
      "file_path": ""
    },
    {
      "title": "Ep12. The True Peace of the Jewish People",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "13-09-24",
      "length": "29.72 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2B1MJgpRlkcUstC3whjMmD",
      "series": "",
      "episode_number": 12,
      "file_path": ""
    },
    {
      "title": "Ep11. The Power of the King",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "03-09-24",
      "length": "27.75 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/18F1iFiFhAVsPNNMy54ydN",
      "series": "",
      "episode_number": 11,
      "file_path": ""
    },
    {
      "title": "Ep10. A True Servant of Hashem",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "24-08-24",
      "length": "31.5 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1tyvlhn4h0fqxy4Ym1mJTp",
      "series": "",
      "episode_number": 10,
      "file_path": ""
    },
    {
      "title": "Ep9. The Malchus of the Jewish People",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "17-08-24",
      "length": "29.41 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2mG7nnf6eojoYpgDbXBKyk",
      "series": "",
      "episode_number": 9,
      "file_path": ""
    },
    {
      "title": "Ep8. Everything is Different on Shabbos",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "07-08-24",
      "length": "33.19 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5WsndrL8grxwBueiMIBOue",
      "series": "",
      "episode_number": 8,
      "file_path": ""
    },
    {
      "title": "Ep7. Citizen of Hashem's Nation",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "23-07-24",
      "length": "25.01 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5q9NyCA7sKfr9GB4lhCAp3",
      "series": "",
      "episode_number": 7,
      "file_path": ""
    },
    {
      "title": "Ep6. Shabbos is the Gateway for Hashem",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "12-07-24",
      "length": "23.97 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0Y7TxWXMGf2dt5S61Ds29Z",
      "series": "",
      "episode_number": 6,
      "file_path": ""
    },
    {
      "title": "Ep5. Greatest Elevation of the World",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "06-07-24",
      "length": "29.47 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1iCOG0qShnh2yXQt9BUDCM",
      "series": "",
      "episode_number": 5,
      "file_path": ""
    },
    {
      "title": "Ep4. The Kings Crown",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "27-06-24",
      "length": "22.5 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/7mQKqOzNXKuE6h3GhcDeWh",
      "series": "",
      "episode_number": 4,
      "file_path": ""
    },
    {
      "title": "Ep3. What Is Malchus",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "26-06-24",
      "length": "26.16 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3xrj0akFP6nCAbb1VygdsU",
      "series": "",
      "episode_number": 3,
      "file_path": ""
    },
    {
      "title": "Ep2. Hashem's Day",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "25-06-24",
      "length": "28.34 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4slzOgab38dEfnFPclMvBy",
      "series": "",
      "episode_number": 2,
      "file_path": ""
    },
    {
      "title": "Ep1. Shabbos Malchusa",
      "description": "Why do I feel like I don't connect to Shabbos? Come learn what is the essence of Shabbos and how I can make the most out of it.",
      "date": "07-06-24",
      "length": "23.57 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6sJlE11KXGro2R6w9H5nTq",
      "series": "",
      "episode_number": 1,
      "file_path": ""
    }
  ]
}