{
  "episodes": [
    {
      "title": "פרק 8 - הפוך את הכבוד למטבע החזק ביותר בממלכה הזוגית שלך",
      "description": "איך ייתכן שהדרך למנהיגות אמתיתבבית עוברת דווקא דרך הענקת כבוד, ולא דרישתו? בעולם שמטשטש את הגבולות בין תפקידיהגבר והאישה, זוגות רבים מוצאים את עצמם במאבק כוח שקט או גלוי, ששוחק את השותפותומייצר תסכול. בפרק זה, הרב ארי קלפר חושף את המנגנון הפסיכולוגי העמוק שטמוןבתפיסת התורה על זוגיות, ומראה כיצד המבנה שהתורה מציעה אינו כובל, אלא משחרר אתהפוטנציאל הטבעי לקשר בריא ומעצים.דרך ניתוח סיפורים נוגעים מהחיים – על ה'צדיק' שגילה כיצד לרפא את דיכאון אשתו ועל הזוג שהתמודד עם פערים בהשקפה– הרב קלפר מראה כיצד \"כבוד\" אינו מחווה ריקה,אלא הכלי המרכזי ליצירת ביטחון רגשי. תגלו בפרק מדוע האחריות הראשונית להענקת הכבודמוטלת על הגבר, וכיצד פעולה זו מפעילה באופן כמעט אוטומטי את רצונה הטבעי של האישהלהעניק כבוד, הערכה ושותפות בחזרה. זהו שיעור מעשי על הפיכת הדינמיקה הביתית ממלחמהעל צדק לבנייה משותפת של אמון.זהו לא שיעור על חלוקת תפקידיםנוקשה, אלא מפת דרכים לשינוי האקלים הרגשי בביתכם. אתם מחזיקים בכוח להפוך ויכוחיםעל שליטה להזדמנות לבניית ממלכה של כבוד הדדי. מוכנים לגלות את סוד המנהיגות שאינהדורשת, אלא מעניקה?ב...",
      "date": "10-09-25",
      "length": "13:58",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4zImVTGVSMVyOACjk6ZLpU",
      "series": "shalom-bayis-hebrew",
      "episode_number": 11,
      "file_path": "data\\Shalom Bayis Hebrew_episodes.csv"
    },
    {
      "title": "פרק 9 מה אם ההבדלים ביניכם הם לא הבעיה, אלא המפתח לקשר עמוק?",
      "description": "האם אתה העוגן של הבית, או שגם אתה נסחף בסערה הרגשית? גברים רבים חשיםתסכול ובלבול מול השינויים במצב הרוח של נשותיהם, ומרגישים כאילו הם מדברים שפותשונות. תחושת ה\"שלמות\" הראשונית מתפוגגת, ובמקומה מופיע ריחוק שקט. בפרקזה, הרב ארי קלפר חושף כיצד התורה רואה בהבדלים הביולוגיים והרגשיים לא מכשול, אלאאת התשתית לבניית קשר עמוק ואמיתי. הוא מראה כיצד טבעו היציב של הגבר הוא בדיוקהכלי שהקב\"ה נתן לו כדי להפוך לעוגן של ביטחון עבור אשתו.באמצעות תובנות חותכות מדברי הסטייפלר, הגורס שהצורך של אישה להרגיש אהובההוא \"קרוב לפיקוח נפש\", והדרכה מעשית ל\"שמוע בקולה\" – כלומר, להקשיב לשפת הגוף ולטון שמאחורי המילים – הרב קלפר מציע מפת דרכים לגבר המודרני. תגלו מדועהריב הגדול הראשון הוא סימן בריא להתפתחות הקשר, כיצד האחריות למצב הרגשי בבית מוטלתעל הגבר, ואיך להפסיק לבטל את רגשותיה כ\"סתם הורמונים\" ולהתחיל להבין אותהכ\"סוגיה\" עמוקה שיש ללמוד באהבה.הפרק הזה יעניק לכם כלים להפוך מבעל מבולבל למקור של יציבות וכוח. היכולתלהיות העוגן שהיא צריכה כבר טמונה בך; כל מה שצריך זה ללמוד כיצד להשתמש בה.מוכנים להפסיק להילחם בהבדלים ו...",
      "date": "10-09-25",
      "length": "15:50",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/1b5aRYYsst1318mMl9yCQf",
      "series": "shalom-bayis-hebrew",
      "episode_number": 10,
      "file_path": "data\\Shalom Bayis Hebrew_episodes.csv"
    },
    {
      "title": "פרק 10 - האם אתם בונים שותפות עסקית, או משלימים את הנשמה שלכם?",
      "description": "מה אם השגרה שהשתלטה על הנישואיןשלכם אינה סימן לדעיכה, אלא הזמנה סודית להגיע לרמה העמוקה ביותר של אחדות? כל זוגמכיר את הרגע שבו ההתלהבות הראשונית מתפוגגת, והחיים המשותפים הופכים לרצף שלמטלות מוכרות. התחושה של \"למה אני עובד כל כך קשה?\" מתחילה לחלחל. בפרקזה, הרב ארי קלפר חושף את התשובה המהפכנית של התורה לשאלה הזאת, ומגלה שהמטרההאמיתית של הנישואין אינה שותפות יעילה, אלא איחוד מחדש של נשמה אחת שהתפצלה.דרך בחינה נוקבת של מושגיםיומיומיים, הרב קלפר מראה כיצד תפיסה זו משנה הכל: מדוע גישה של \"חסד\"עלולה להרוס את הקרבה, כיצד אמירת \"תודה\" על הכביסה היא למעשה השקעהישירה בעצמך, ומדוע ההשוואה לחיים המזויפים ברשתות החברתיות היא מלכודת מסוכנת.תלמדו לראות את בן או בת הזוג לא כ\"אחר\" שיש לשרת, אלא כחלק בלתי נפרדמעצמכם – מה שהופך כל פעולה, קטנה ככל שתהיה, לעבודת קודש של בנייתמקדש פרטי.זהו לא עוד שיעור על שלום בית;זוהי קריאה לשינוי תודעתי שיצית מחדש את תחושת המשמעות והשליחות בזוגיות שלכם.הכוח להפוך את השגרה לחוויה רוחנית נמצא כבר בידיכם. מוכנים לגלות כיצד להשקיעבעצמכם על ידי השקעה באחדות שלכם?בהנחיית הרב ...",
      "date": "10-09-25",
      "length": "26:59",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/124C9tShwtSyCgREOZlYWU",
      "series": "shalom-bayis-hebrew",
      "episode_number": 9,
      "file_path": "data\\Shalom Bayis Hebrew_episodes.csv"
    },
    {
      "title": "פרק 11 - הפסיקו לצעוק בצרפתית: כך תלמדו לדבר בשפה שהלב שלה מבין",
      "description": "האם אתם מרגישים שלמרות כל המאמצים, המסר שלכם פשוט לא עובר? כמו תיירשצועק בצרפתית למישהו שמבין רק ספרדית, זוגות רבים מוצאים את עצמם מותשים ותקועיםבמעגל של אי הבנות, למרות הכוונות הטובות. התחושה הראשונית של \"היא מבינהאותי\" מתחלפת בפחד לדבר ובריחוק שקט. בפרק זה, הרב ארי קלפר חושף את אחדהכלים העוצמתיים ביותר לתיקון וחיזוק הקשר: ההבנה שלכל אדם יש \"שפתאהבה\" ייחודית, והמשימה שלנו היא ללמוד לדבר בה.דרך סיפורים נוגעים ללב על הבעל שהשקיע הון בחופשות כשאשתו חלמה על כוסקפה, ועל הבחור בפגישות שגילה את המפתח לקשר אמיתי, הרב קלפר מפרק את מושג התקשורתלגורמים מעשיים. תגלו כיצד ללמוד את אשתכם \"כמו סוגיה\", לזהות האם השפהשלה היא זמן איכות, מחמאות, עזרה מעשית או מתנות קטנות, וכיצד פתיחת הלב שלכם היאהמעשה האמיץ ביותר שיכול לבנות אמון ששום דבר אחר לא יכול להחליף.זהו מדריך מעשי שיעזור לכם להפוך מתסכול לתקשורת אפקטיבית. במקום להגביר אתהווליום באותה שפה שלא עובדת, אתם תלמדו כלים פשוטים כדי להתחיל לדבר ישר אל הלבשלה. מוכנים להפסיק לתרגם ולהתחיל סוף סוף להיות מובנים?בהנחיית הרב ארי קלפר ובהפקת EliPodcast Produ...",
      "date": "10-09-25",
      "length": "25:26",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4currUrfxOu1YW3xNiXq8n",
      "series": "shalom-bayis-hebrew",
      "episode_number": 8,
      "file_path": "data\\Shalom Bayis Hebrew_episodes.csv"
    },
    {
      "title": "פרק 7 - כשנגרמת פגיעה",
      "description": "מדוע אנחנו מגיבים אחרת לביקורת? הרב קלאפר מעמיק בהבדלים המהותיים בין איש ואישה, וחושף את השורש הפסיכולוגי של יצר הנקמה. כשאישה מעירה הערה פוגעת, האיגו הגברי נפגע ודורש תגובה מיידית - תגובה שעלולה לפגוע עוד יותר בשלום הבית. הרב מלמד גישה מהפכנית: הקב\"ה שולח את המסר דרך בת הזוג שלנו, ויש לקבל את הביקורת ממקום של אהבה וצמיחה.הרב קלאפר מבאר את עומק רעיון \"עזר כנגדו\" - מדוע ברא הקב\"ה את האישה שונה מהאיש, ואיך השוני הזה הוא בדיוק מה שהופך אותנו לשלמים. דרך הסיפור המרתק על רבי יוחנן, שהתגעגע לתלמיד שידע להקשות על דבריו, אנו מבינים שמטרת הנישואין היא לא רק חברות - אלא דווקא ההשלמה שבאה דרך השוני. הרב מציג ביקורת נוקבת על השקפת העולם הפמיניסטית המודרנית, ומראה כיצד דווקא בטשטוש התפקידים אנחנו מפסידים את האושר האמיתי שבזוגיות. שיעור עמוק שמזמין אותנו לחזור לטבע האמיתי שלנו, להבין את התפקידים הייחודיים של האיש והאישה, ולמצוא את הדרך לחיים של אהבה ושמחה אמיתית בבית היהודי.מוגש על ידי הרב ארי קלאפר ומופק על ידי Eli Podcast Productions, פרק זה הוא חלק מסדרת \"יהדות אמיתית\", זמין באתר RealJudaism.org. אל תשכחו להירשם כמנויים ולשתף כדי להישאר מחוברים לשיעורים היומיים שלנו ולתובנות התורה הנצחיות!",
      "date": "16-11-24",
      "length": "36.03 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/3jRYQKb8i8UwntNuFbc3fZ",
      "series": "shalom-bayis-hebrew",
      "episode_number": 7,
      "file_path": "data\\שלום בית לגברים _ Shalom Bayis Lgvarim_episodes.csv"
    },
    {
      "title": "פרק 6 - צעד קטן",
      "description": "למה מריבות זוגיות חוזרות על עצמן שוב ושוב, ואיך אפשר לפתור אותן באמת? הרב קלאפר משווה את ההבדל בין איש לאישה להבדל בין אדם שיש לו רק חוש ראייה לבין אדם שיש לו רק חוש שמיעה – הם פשוט חווים את אותו העולם אחרת לגמרי. מתוך הבנה זו, נלמד כיצד לגשת למחלוקות בצורה בריאה ובונה.במקום לבזבז אנרגיה על האשמות והגדלת הבעיה, הרב קלאפר מלמד אותנו לשאול תחילה \"למה זה מפריע לי כל כך?\" - שאלה שמובילה לגילויים מפתיעים על עצמנו. נקבל כלים מעשיים לניהול מחלוקות: איך להיות רגועים לפני שיחה טעונה, למה אסור לזלזל בבן/בת הזוג (וההבדל המכריע בין כעס לזלזול), וכיצד להשתמש ב\"אני\" במקום \"את/ה\" בתקשורת. הרב מסביר מדוע כל ביקורת נחווית על ידי האישה כמו לעמוד מול אלף אנשים ולהתבייש, וכיצד להפריד בין בעיות גדולות וקטנות.דרך הבנת הפסיכולוגיה העמוקה של התקשורת הזוגית, נלמד להתמודד עם אתגרים יומיומיים בדרך שמחזקת את הקשר במקום להחלישו. שיעור חיוני לכל מי שרוצה להפוך ויכוחים למנוף לצמיחה זוגיתמוגש על ידי הרב ארי קלאפר ומופק על ידי Eli Podcast Productions, פרק זה הוא חלק מסדרת \"יהדות אמיתית\", זמין באתר RealJudaism.org. אל תשכחו להירשם כמנויים ולשתף כדי להישאר מחוברים לשיעורים היומיים שלנו ולתובנות התורה הנצחיות!",
      "date": "29-09-24",
      "length": "31.19 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4hINfLOm0jO2B6jbv0WTKD",
      "series": "shalom-bayis-hebrew",
      "episode_number": 6,
      "file_path": "data\\שלום בית לגברים _ Shalom Bayis Lgvarim_episodes.csv"
    },
    {
      "title": "פרק 5 - חשיבות המחמאות",
      "description": "מהו הסוד הגדול שמאחורי בית שמלא באהבה? הרב קלאפר חושף את הנוסחה הפשוטה אך העמוקה של \"עשה טוב וסור מרע\" בהקשר הזוגי. בניגוד למקובל, הוא מלמד שדווקא בבניית הבית עלינו להתחיל ב\"עשה טוב\" - ליצור אווירה חיובית של הערכה והכרה, לפני שניגשים לתיקון הדברים הטעונים.דרך דוגמאות מעשיות, הרב מסביר מדוע מחמאות הן כמו אוויר לנשימה עבור האישה, וכיצד הערכה אמיתית יוצרת את הבסיס לתקשורת פתוחה. אנו לומדים את העוצמה של מחמאות מפורטות ואישיות, במיוחד בתחומים \"נשיים\" כמו לבוש והופעה, וכיצד הן משפיעות על בניית הערך העצמי. הרב קלאפר גם חושף את הפסיכולוגיה העמוקה מאחורי ויכוחים חוזרים והאופן שבו ביקורת פוגעת באישה, ומציע דרכים חכמות להתמודד עם אתגרים זוגיים - מכספים ועד תחומים אינטימיים - תוך שמירה על כבוד ואהבה. שיעור חיוני לכל מי שרוצה להפוך את ביתו למקום של צמיחה, הערכה ואהבה אמיתית.מוגש על ידי הרב ארי קלאפר ומופק על ידי Eli Podcast Productions, פרק זה הוא חלק מסדרת \"יהדות אמיתית\", זמין באתר RealJudaism.org. אל תשכחו להירשם כמנויים ולשתף כדי להישאר מחוברים לשיעורים היומיים שלנו ולתובנות התורה הנצחיות!",
      "date": "03-09-24",
      "length": "32.46 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/4fX3PRVFfuweIWnMP3PGDN",
      "series": "shalom-bayis-hebrew",
      "episode_number": 5,
      "file_path": "data\\שלום בית לגברים _ Shalom Bayis Lgvarim_episodes.csv"
    },
    {
      "title": "פרק 4 - האופן בו תאהב את אשתך",
      "description": "מה קורה כשהעננים הראשונים של אהבת החתונה מתפזרים? הרב קלאפר מעמיק בהבדל המכריע בין \"חשק\" - הרצון לקבל בשביל עצמי, לבין \"אהבה אמיתית\" - הרצון להתקשר למעלות ולגדלות של האחר. דרך הסיפור המפתיע של יעקב אבינו שעבד שבע שנים לרחל \"ויהיו בעיניו כימים אחדים\", נחשף הסוד העמוק שמאחורי זוגיות יציבה ומשמעותית.הרב קלאפר מסביר מדוע לאחר החתונה כה רבים מרגישים ירידה בקשר, ומה הטעות הבסיסית בתפיסת האהבה שגורמת לכך. נלמד את הפסיכולוגיה העמוקה שמאחורי ויכוחי הזוגות - מדוע אישה תעדיף לעתים להתווכח במקום להודות בטעות קטנה, ואיך הכרה בדינמיקה זו יכולה לשנות את התקשורת הזוגית. העיקרון המעשי של הערכה וביטויה, בייחוד בזמנים ובמקומות קשים, הופך ל\"אוויר\" החיוני לאישה, ואנו נקבל כלים מעשיים לפתח מיומנות זו בחיי היומיום. שיעור חיוני לכל מי שרוצה להבין את ההבדל בין אהבה שנובעת מרגש חולף לבין אהבה שבונה בית לנצח.מוגש על ידי הרב ארי קלאפר ומופק על ידי Eli Podcast Productions, פרק זה הוא חלק מסדרת \"יהדות אמיתית\", זמין באתר RealJudaism.org. אל תשכחו להירשם כמנויים ולשתף כדי להישאר מחוברים לשיעורים היומיים שלנו ולתובנות התורה הנצחיות!",
      "date": "18-08-24",
      "length": "28.46 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/5T9vI5AX97sABni0qVuTvF",
      "series": "shalom-bayis-hebrew",
      "episode_number": 4,
      "file_path": "data\\שלום בית לגברים _ Shalom Bayis Lgvarim_episodes.csv"
    },
    {
      "title": "פרק 3 - החיוב לאהוב את אשתך",
      "description": "מהי באמת אהבה בין בני זוג? הרב קלאפר מציב שאלה מאתגרת על דברי הרמב\"ם: מדוע יש חיוב מדרבנן לאהוב את האישה כגופו, כאשר כבר קיים חיוב דאורייתא לאהוב כל אדם כמוך? דרך ניתוח עמוק של מהות האהבה, אנו מגלים את החידוש המפתיע - רק בקשר הזוגי ניתן באמת להגיע למדרגה הגבוהה של \"ואהבת לרעך כמוך\".הרב קלאפר מסביר כיצד הפעולות הופכות להרגשות, וחושף את הסוד שהקב\"ה טבע באישה - התשוקה לבעלה תלויה ביכולתו להעניק לה אהבה אמיתית. נלמד מדוע השקעה קבועה בקשר, גם בזמנים עמוסים עם ילדים, היא המפתח לבניית בית חזק, ומדוע קביעת זמנים לקשר אינה \"עסקית\" אלא דווקא ביטוי לחשיבותו. דרך דוגמאות מחיי היומיום והתמודדות עם אתגרים אמיתיים, הרב מראה כיצד כל בעל יכול לקבוע את האווירה בבית ולהפוך את הנישואים ל\"דבר המרכזי בתוך החיים\" - המפתח לכל הברכה והשפע.מוגש על ידי הרב ארי קלאפר ומופק על ידי Eli Podcast Productions, פרק זה הוא חלק מסדרת \"יהדות אמיתית\", זמין באתר RealJudaism.org. אל תשכחו להירשם כמנויים ולשתף כדי להישאר מחוברים לשיעורים היומיים שלנו ולתובנות התורה הנצחיות!",
      "date": "23-07-24",
      "length": "27.5 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/2uiTedsrOAGYgecs7vlOjU",
      "series": "shalom-bayis-hebrew",
      "episode_number": 3,
      "file_path": "data\\שלום בית לגברים _ Shalom Bayis Lgvarim_episodes.csv"
    },
    {
      "title": "פרק 2 - עבודת השם דוקא בבית",
      "description": "מה באמת גורם לשכינה לשכון בביתנו? הרב קלאפר חושף את הסוד העמוק שמאחורי הפסוק \"איש ואשה זכו - שכינה ביניהם\". בניגוד לתפיסה המערבית הרואה בזוגיות מערכת הדדית של סיפוק צרכים, התורה מלמדת שהבית הוא מקום להשראת השכינה, המשך ישיר למשכן ולמקדש.דרך ניתוח עמוק של דברי הסטייפלר על טבע האשה והאיש, מתגלה תובנה מפתיעה על הדרך להשיג אהבה אמיתית בבית. הרב קלאפר מסביר כיצד לימוד תורה בבית, עבודת המידות והתמודדות עם כעס הם המפתחות להשראת השכינה ולשפע רוחני וגשמי. אתם תגלו את הכלים המעשיים להתמודד עם הניסיונות היומיומיים של חיי הנישואין מפרספקטיבה תורנית עמוקה, ותבינו מדוע שלום בית אינו רק מטרה אישית, אלא חלק מרכזי בעבודת ה' ובתכלית הבריאה.מוגש על ידי הרב ארי קלאפר ומופק על ידי Eli Podcast Productions, פרק זה הוא חלק מסדרת \"יהדות אמיתית\", זמין באתר RealJudaism.org. אל תשכחו להירשם כמנויים ולשתף כדי להישאר מחוברים לשיעורים היומיים שלנו ולתובנות התורה הנצחיות!",
      "date": "07-07-24",
      "length": "34.55 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/0mJ0inf8scbDpq1hcavhPS",
      "series": "shalom-bayis-hebrew",
      "episode_number": 2,
      "file_path": "data\\שלום בית לגברים _ Shalom Bayis Lgvarim_episodes.csv"
    },
    {
      "title": "פרק 1 - איך תשרה שכינה בביתך",
      "description": "האם יתכן שחיי נישואין הם בגדר נס? הרב קלאפר פותח בשאלה מפתיעה זו ומוביל אותנו למסע עמוק בהבנת מהות הבית היהודי. בעולם שבו המודל החיצוני של נישואין מבוסס על תאווה ואנוכיות בלבד, התורה מציעה דרך אחרת - דרך של בניית מקדש מעט שהשכינה שורה בו. הרב קלאפר מקשר בין בתי האבות - אברהם ושרה, יצחק ורבקה - למשכן עצמו, ומראה כיצד הסימנים לנוכחות השכינה חוזרים בשניהם. דרך סיפורים וניתוח מעמיק, נלמד מדוע התפילה היא המפתח הראשון לבית מוצלח, כיצד להתמודד עם אתגרי התקשורת בין בני זוג, ואיך לשמור על הבית כמקום קדוש בעולם מלא הסחות. שיעור חיוני לכל מי שמבקש להפוך את ביתו למשכן ישראל אמיתי.מוגש על ידי הרב ארי קלאפר ומופק על ידי Eli Podcast Productions, פרק זה הוא חלק מסדרת \"יהדות אמיתית\", זמין באתר RealJudaism.org. אל תשכחו להירשם כמנויים ולשתף כדי להישאר מחוברים לשיעורים היומיים שלנו ולתובנות התורה הנצחיות!",
      "date": "21-06-24",
      "length": "22.77 min",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/028pEnLag4icGUveEPxiiS",
      "series": "shalom-bayis-hebrew",
      "episode_number": 1,
      "file_path": "data\\שלום בית לגברים _ Shalom Bayis Lgvarim_episodes.csv"
    }
  ]
}