{
  "episodes": [
    {
      "title": "פרק ג: מי שולט בחיים שלך: אתה, או חבילת הצ'יפס?",
      "description": "מי שולט בחיים שלך: אתה, או חבילת הצ'יפס?בעולם שמעודד סיפוק מיידי, היכולת להגיד \"לא\" נראית כמו כוח-על נדיר. רבים מאיתנו מרגישים לעיתים קרובות כמו עבדים לדחפים שלנו - בין אם זה הסמארטפון, האוכל או כל פיתוי אחר שקשה לעמוד בפניו. בפרק זה, הרב ארי קלפר חושף ששליטה עצמית אינה רק תכונה רצויה, אלא היא עצם המהות שמבדילה אותנו כבני אדם. הוא מראה כיצד היכולת לדחות סיפוקים למען מטרה גבוהה יותר היא לא ויתור, אלא הדרך היחידה לחירות אמיתית, להצלחה ולמלכות פנימית.באמצעות משל נוקב על חבילת צ'יפס שמכריזה עלינו כעבדיה, ודרך סיפורו של יוסף הצדיק שהפך למלך בזכות שליטתו העצמית, הרב קלפר מפרק את תחושת חוסר האונים. תגלו כיצד התורה אינה מערכת של איסורים, אלא תוכנית אימונים מדויקת לפיתוח \"שריר\" השליטה העצמית, הכלי החזק ביותר שקיים כדי לבנות חיים של משמעות. הפרק מחבר את החכמה העתיקה הזו להתמכרות המודרנית לטכנולוגיה ומספק פרספקטיבה מעצימה להתמודדות.בסיום הפרק, תבינו שהכוח לשלוט בחייכם כבר נמצא בידיכם. תפסיקו להיות עבדים ותתחילו להיות מלכים על ממלכת נפשכם. אתם מצוידים ביכולת לבחור, להגיד \"לא\" לתאוות הרגעיות, ול...",
      "date": "02-10-25",
      "length": "18:34",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/51y5mLdtaeZCu5ygOsq7xL",
      "series": "shmiras-einayim-hebrew",
      "episode_number": 3,
      "file_path": "data\\Shmiras Einayim Hebrew_episodes.csv"
    },
    {
      "title": "פרק ב: הפסק לסחוב את המזוודה הלא נכונה: גלה את סוד החיים היפים",
      "description": "מה אם התורה היא לא משא כבד, אלא מזוודה מלאה ביהלומים?רבים מאיתנו חווים את המאבק הפנימי: התחושה שקיום התורה דורש מאיתנו לוותר על כל הכיף וההנאות שהעולם מציע. האם זו באמת האמת? בפרק עוצמתי זה, הרב ארי קלפר חושף את אחת האשליות הגדולות ביותר שהיצר הרע מוכר לנו. הוא מפרק את התפיסה שהתורה היא עול כבד, ובאמצעות משל מבריק על מזוודה מלאת יהלומים, הוא מראה שאם הדרך מרגישה קשה מדי – ייתכן שאנחנו פשוט סוחבים את המזוודה הלא נכונה.בעזרת מקורות עתיקים מהרמב\"ם והרמב\"ן, הרב קלפר מנתח את המנגנון הפסיכולוגי המדויק של ההתמכרות להנאות רגעיות. תגלו מדוע \"מים גנובים ימטוקו\" רק בהתחלה, וכיצד היצר הרע לוקח את ההנאה בחזרה ומשאיר אותנו עם הרגל ריק ותחושת סבל. הפרק מגשר בין חכמה עתיקה למציאות המודרנית של רשתות חברתיות ופיתויים אינסופיים, ומספק כלים לזהות את \"השיווק הכוזב\" של עולם שמוכר אושר מזויף.בסיום הפרק, תפיסת העולם שלכם תשתנה. תבינו שהבחירה בשמירת העיניים ובדרך התורה אינה ויתור, אלא ההשקעה החכמה ביותר בחיים של שמחה, סיפוק ואיכות, גם בעולם הזה. אתם מצוידים ביכולת לזהות את השקר ולבחור באמת. מוכנים להחליף את...",
      "date": "18-09-25",
      "length": "25:46",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/18riktIH1x4WVuovtdyAnK",
      "series": "shmiras-einayim-hebrew",
      "episode_number": 2,
      "file_path": "data\\Shmiras Einayim Hebrew_episodes.csv"
    },
    {
      "title": "פרק א: עזוב את המהפכה, תתחיל בצעד אחד",
      "description": "מה אם הפחד מהשינוי גדול יותר מהשינוי עצמו? חודש אלול מגיע, ואיתו הרצון להתקרב והלחץ לעשות \"חשבון נפש\". רבים מאיתנו מכירים את התחושה המשתקת הזו: אנחנו יודעים שעלינו להשתנות, אבל הר המשימות נראה גבוה מדי, והפחד להסתכל פנימה בכנות פשוט משתק אותנו. בפרק זה, הרב ארי קלפר חושף פרספקטיבה משחררת שמפרקת את מעגל הייאוש. הוא מראה כיצד חכמת התורה לא דורשת מאיתנו מהפכה של רגע, אלא מזמינה אותנו למסע שמתחיל בצעד אחד, קטן ואפשרי, שהופך את כל התמונה. דרך ניתוח המנגנון הפסיכולוגי של הפחד ודוגמאות מהחיים המודרניים – מההתמודדות עם הסמארטפון ועד נרמול המאבק בשמירת העיניים – הרב קלפר מציע אסטרטגיה מעשית ופורצת דרך. במקום להתמקד ביעד הסופי והמפטיד, נלמד לזהות את הפעולה הקטנה ביותר שאנו כן יכולים לעשות היום, ולהבין שבעיני הקב\"ה, עצם ההתחלה וההשתדלות הן העיקר. תגלו כיצד להניח את הטלפון לחמש דקות יכול להיות מעשה רוחני גדול יותר מלהחליט החלטות גדולות שלעולם לא נקיים. בסיום הפרק תצאו עם תחושת הקלה והעצמה. תבינו שהכוח לשנות לא נמצא בפסגת ההר, אלא בנכונות שלכם לעשות את הצעד הראשון והצנוע ביותר. אתם מסוגלים להתחיל, לא מחר, אלא עכשיו, בפעולה זעירה שתניע תהליך של צמיחה אמיתית. מוכנים להפוך את הפחד לכוח המניע שלכם? בהנחיית הרב ארי קלפר ובהפקת אלי פודקאסט הפקות, פרק זה הוא חלק מסדרת \"יהדות אמיתית\", הזמינה ב-RealJudaism.org. אל תשכחו להירשם ולשתף כדי להישאר מחוברים לשיעורים היומיים ולתובנות התורה הנצחיות שלנו",
      "date": "04-09-25",
      "length": "00:27:40",
      "spotify_embed_url": "https://open.spotify.com/embed/episode/6M0N1AceP8lsegtJVKRIou",
      "series": "shmiras-einayim-hebrew",
      "episode_number": 1,
      "file_path": "data\\shmiras-einayim-hebrew_episodes.csv"
    }
  ]
}