{
    "episodes":  [
                     {
                         "title":  "Ep. 9 - The Secret of Time",
                         "description":  "What if the greatest gift you can give your wife is also the simplest?Time isn’t just something you spend — it’s something you give. In this episode, Rabbi Ari Klapper reveals a profound truth about marriage: More than money, gifts, or even words, a wife’s deepest desire is to feel that her husband values their time together. Through the mitzvos and halachos, Rabbi Klapper shows how Torah wisdom emphasizes the power of intentional time.Discover why time isn’t just a practical consideration but a spiritual investment in your marriage. Learn why spontaneity often backfires and how scheduling time with your wife — and preparing for it — shows her that she’s your priority. From halachic insights to real-life stories, this episode uncovers the secret to making your wife feel like the most important person in your life.Ready to unlock the true potential of your marriage? Tune in to discover how giving your time can transform your relationship and bring lasting closeness and peace.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "22-11-24",
                         "length":  "32.64 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/0XimxIFJXZKhK5Z7KlgtC3",
                         "series":  "shalom-bayis",
                         "episode_number":  9,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     },
                     {
                         "title":  "Ep. 8 - Understanding Your Wife",
                         "description":  "Do you really know the person you married?At the start of marriage, it’s easy to believe you’ve found someone just like you. But as life unfolds, the differences emerge — often leaving a husband wondering, “Did I marry the right person?” In this episode, Rabbi Ari Klapper reveals that these differences aren’t a mistake; they’re Hashem’s plan for growth and connection. Your wife’s unique personality, upbringing, and emotional world were custom-designed for you to become the best version of yourself.Through Torah insights and practical examples, Rabbi Klapper guides husbands to truly understand their wives’ emotional needs and nature. From handling emotional outbursts to respecting her unique thought process, you’ll learn how to respond with patience and love. Discover how to avoid the trap of comparisons and instead focus on building a deep, exclusive connection with your wife — recognizing that her nature, even when challenging, is Hashem’s gift to help you grow.Ready to move beyond frustration and see your wife as your greatest asset? Tune in to uncover the hidden wisdom behind marriage differences and strengthen your bond with understanding and respect.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "10-11-24",
                         "length":  "24.95 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/5R5foB2yPJKZj3DP0qovtH",
                         "series":  "shalom-bayis",
                         "episode_number":  8,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     },
                     {
                         "title":  "Ep. 7 - A Man\u0027s Needs, Exclusivity",
                         "description":  "What does it mean to truly belong to each other?In this powerful episode, Rabbi Ari Klapper delves into the core of a man’s identity in marriage: his physical and emotional needs. The Torah doesn’t shy away from acknowledging a man’s desires — but it also provides boundaries to elevate those desires into something holy. Rabbi Klapper reveals that true connection in marriage isn’t just about fulfilling physical needs; it’s about creating an exclusive relationship, one where both husband and wife are entirely devoted to each other.Drawing from halacha and timeless Jewish wisdom, this episode explores why exclusivity is the foundation of marriage. From the halachos of Harchakos to practical tips on maintaining emotional closeness, listeners will discover how to strengthen their marriages by focusing their energy, love, and attention solely on their spouses. Rabbi Klapper warns against subtle distractions — interactions with other women, even seemingly innocent ones, can erode the deep bond of marriage.Ready to transform your marriage into a fortress of trust and loyalty? Learn how exclusivity isn’t just a rule — it’s the secret to true intimacy and lasting love.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "17-10-24",
                         "length":  "26.4 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/1qpIU3ZIJvQuISypD3sI2n",
                         "series":  "shalom-bayis",
                         "episode_number":  7,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     },
                     {
                         "title":  "Ep. 6 - How to (not) Fight",
                         "description":  "Can you win an argument without losing your wife?Disagreements are inevitable in marriage — but the way you handle them can either strengthen or damage your relationship. In this episode, Rabbi Ari Klapper explores the art of conflict in a Torah home. He explains why anger and blame erode trust, while patience and sensitivity build lasting peace. A wife’s deepest desire is to feel respected and valued by her husband. But when criticism is delivered harshly or repeatedly, it can trigger defensiveness and drive a wedge between them.Rabbi Klapper offers practical tools for avoiding destructive fights and turning conflicts into opportunities for growth. Learn how to speak with humility, frame conversations constructively, and avoid language that escalates tension. Discover how to respond when emotions run high and why choosing the right words — or staying silent for a moment — can make all the difference.Ready to master the art of peaceful communication? Tune in to learn how to turn moments of tension into opportunities for deeper connection and trust.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "13-09-24",
                         "length":  "21.95 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/3c9keSRk9hXBF6Q3cZAxjO",
                         "series":  "shalom-bayis",
                         "episode_number":  6,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     },
                     {
                         "title":  "Ep. 5 - Positive Improvements",
                         "description":  "What if the way you offer criticism is the biggest obstacle to your marriage’s growth?Rabbi Ari Klapper takes a deep dive into one of the hardest topics in marriage: giving and receiving criticism. It’s easy to focus on how others need to change — but when your words hurt more than help, you risk damaging the very relationship you want to improve. This episode explores how criticism, even when well-intentioned, often triggers feelings of inadequacy, especially in a wife who desires her husband’s respect more than anything else.Discover how to shift from blaming to building. Rabbi Klapper shares practical insights on addressing household issues with sensitivity, reframing conversations around improvement rather than fault, and creating an atmosphere where both partners feel respected. Learn how understanding the root cause of frustrations can transform criticism into constructive growth.Ready to change your home’s dynamic? Tune in to learn how to address challenges with wisdom and turn potential conflict into an opportunity for connection and mutual support.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "17-08-24",
                         "length":  "24.22 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/5G3tAoVafrlkqB6KIWEJwE",
                         "series":  "shalom-bayis",
                         "episode_number":  5,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     },
                     {
                         "title":  "Ep. 4 - A Husband\u0027s Main Obligation",
                         "description":  "Who shapes your wife’s sense of self-worth? You do.Chazal teach that a husband has the power to build his wife into who she is meant to be — or to tear her down. Rabbi Ari Klapper delves into this often-overlooked responsibility and shows how a wife’s entire self-image is shaped by her husband’s reactions. What you say, how you respond, and whether you acknowledge her efforts matter more than you realize.This episode uncovers the secret to creating lasting emotional security in marriage: intentional praise and thoughtful support. Drawing from the Torah’s portrayal of Yaakov Avinu’s love for Rochel, Rabbi Klapper explains that love isn’t just about feelings — it’s about recognizing your spouse’s unique qualities and helping them flourish. Learn practical ways to express appreciation, build trust, and become the partner your wife longs for you to be.What’s your real job in marriage? Discover how to transform your relationship through words that uplift, actions that support, and a commitment to truly see your wife.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "23-07-24",
                         "length":  "18.9 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/2BOEbJBar02bURSEjYGmKu",
                         "series":  "shalom-bayis",
                         "episode_number":  4,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     },
                     {
                         "title":  "Ep. 3 - Invest in Yourself",
                         "description":  "Is giving in your marriage a burden or a gift?We explore a profound truth: Marriage isn’t just about sacrificing for your spouse — it’s about investing in yourself. Many people enter marriage thinking love will naturally sustain itself, but Rabbi Klapper reveals why love must be actively nurtured and grown through meaningful acts of giving. He shows how real connection happens when each partner fills in the gaps for the other, not because they have to, but because they choose to.Through Torah insights and timeless wisdom, you’ll learn how to reframe your mindset from “I gave up for my spouse” to “I invested in us.” Discover how showing genuine respect, building your spouse’s self-esteem, and stepping in where they need support transforms a marriage from routine to remarkable. Rabbi Klapper draws a powerful parallel from the story of Michal, the daughter of Shaul, to highlight the impact of feeling valued and supported in a relationship.Ready to see your marriage as your most meaningful investment? This episode will challenge you to invest deeply in your relationship and, in doing so, find the greatest returns — love, connection, and spiritual growth.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "06-07-24",
                         "length":  "12.15 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/3wXEIAO3kFCqrQZMa7tAoi",
                         "series":  "shalom-bayis",
                         "episode_number":  3,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     },
                     {
                         "title":  "Ep. 2 - Make It Your Goal",
                         "description":  "Is your Shalom Bayis an afterthought or your life’s mission?Rabbi Ari Klapper challenges us to rethink our priorities. Achieving Shalom Bayis isn’t something that just happens — it requires conscious effort, intention, and a clear goal. Drawing from Torah sources, Rabbi Klapper reveals why a peaceful home must become your primary life mission. He explains how the Shechinah dwells only where true unity and mutual care exist, as exemplified by the home of Avraham and Sarah.Discover practical strategies for making Shalom Bayis a real goal: infusing davening with heartfelt requests for harmony, overcoming communication barriers with courage and sensitivity, and learning how small, consistent acts of kindness build a foundation of trust and love. Whether newly married or seeking to strengthen your marriage, this episode offers timeless wisdom to elevate your relationship and bring Hashem into your home.Ready to transform your marriage into a haven of peace and divine connection? Tune in now and take the first step toward a home filled with blessing and spiritual growth.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "21-06-24",
                         "length":  "23.66 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/1yQ7fO78oCq32U59uQ1m8B",
                         "series":  "shalom-bayis",
                         "episode_number":  2,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     },
                     {
                         "title":  "Ep. 1 - Introduction",
                         "description":  "What if your biggest asset in life is also your biggest challenge?For a man and woman to live together in peace isn’t just a nice idea — it’s a miracle. Rabbi Ari Klapper opens the Shalom Bayis series by confronting a stark truth: Men and women, with their different backgrounds and emotions, are naturally at odds. Yet, Hashem commands us to achieve peace in our homes. How can this be possible? How do two people, each with their own fire, avoid burning each other out?In this episode, Rabbi Klapper reveals a deep Torah perspective on marriage: The Shechinah must dwell in your home. Without Hashem, even the most loving couple risks being consumed by anger and frustration. Through powerful insights from Chazal, including the Zohar’s view on anger and the role of davening for Shalom Bayis, listeners will learn practical steps to bring Hashem into their marriage. Discover why Torah learning at home, sensitivity to your spouse’s emotions, and asking questions to a trusted Rav aren’t just good ideas — they are essential to creating a home where peace can truly reign.Are you ready to bring the Shechinah into your home? This episode sets the foundation for transforming your marriage into a source of bracha, stability, and divine presence.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "07-06-24",
                         "length":  "23.75 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/557WzMXUjEnKsPNZtVn8Bj",
                         "series":  "shalom-bayis",
                         "episode_number":  1,
                         "file_path":  "data\\Shalom Bayis for Men_episodes.csv"
                     }
                 ]
}