{
    "episodes":  [
                     {
                         "title":  "Ep. 11 - See Beyond Temptation",
                         "description":  "Who are you when no one is watching? And what does your name say about your mission in this world?This episode takes us into one of the most powerful scenes in Torah: Yosef alone, far from home, facing a test no one would ever know about—except Hashem. What gave him the strength to walk away when everything inside him said yes? The answer: he remembered who he was. Rabbi Klapper uncovers the profound idea that a Jew’s name isn’t just a label—it’s a reflection of their essence. Yosef saw his father’s face and remembered his future—his name engraved on the Choshen, his destiny as one of the Shvatim—and it gave him the clarity and strength to say no.But what if we didn’t say no? Rabbi Klapper doesn’t stop with the tzaddik who stands strong—he brings us to Yehuda, who fell and got up again. The Torah’s message is clear: whether you overcome or stumble, you’re still part of the story. The Yetzer Hara wants us to forget who we are. Tshuva helps us remember. This episode gives the listener tools to fight temptation in private, resist the crushing voice of shame, and believe that every struggle and every comeback is part of a divine plan.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!\n]]\u003e",
                         "date":  "28-07-25",
                         "length":  "00:19:23",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/104634990",
                         "series":  "shmiras-einayim",
                         "episode_number":  11,
                         "file_path":  "data/shmiras_einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 10 - The Power in Privacy",
                         "description":  "What if the key to your deepest strength is what you choose to keep hidden?In a world that tells us to flaunt everything, the Torah tells us something radically different: keep the most powerful parts of yourself private. Real power, real holiness, lies in what you don’t reveal. In this episode, Rabbi Klapper takes us deep into the heart of tznius—not just as a dress code or a social rule, but as a spiritual strategy for greatness. Why did Rochel Imeinu give away her simanim? Why did Shaul HaMelech and Esther Hamalka keep their identities secret until the perfect moment? Because true strength is built in silence, and only revealed when it counts.But this idea doesn’t stay in the abstract. It speaks directly to one of the hardest challenges we face—Shmiras Einayim. Rabbi Klapper explains how guarding our eyes, our desires, and our inner world preserves something priceless: the ability to build a powerful, lasting connection with a future spouse. What seems like a restriction is really an investment. Every moment of self-control now creates lifelong depth later. And even if we’ve fallen, we can always rebuild. Hashem gave us the gift of teshuva—and the strength to hold out for something infinitely greater.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!\n]]\u003e",
                         "date":  "14-07-25",
                         "length":  "00:26:37",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/104634910",
                         "series":  "shmiras-einayim",
                         "episode_number":  10,
                         "file_path":  "data/shmiras_einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 9 - Two Types of Embarrassment",
                         "description":  "Can shame lift you—or destroy you? It depends on what you believe about yourself.Everyone feels busha. It’s one of the defining traits of a Jew. But not all embarrassment is created equal. Some forms of shame tear a person down, convincing them they’re worthless and hopeless. Other forms awaken something deeper—reminding you that you’re too valuable to live beneath your greatness. In this powerful and deeply personal episode, Rabbi Klapper explores the difference between toxic guilt and uplifting embarrassment. Why do we sometimes feel like giving up after a fall? And what would change if we believed we were too holy to fall, not too dirty to rise?Drawing on Torah sources, psychological insight, and the sefer From Boys to Men by Dr. Shloime Zimmerman, this shiur brings clarity to the inner chaos many experience when struggling with taivah and self-worth. You’ll discover why your Yetzer Hara often disguises himself as your biggest cheerleader, how social norms distort your self-image, and most importantly—how to remember that you\u0027re a Ben Melech, no matter how far you\u0027ve fallen. If you\u0027ve ever felt crushed by failure or unsure of your value, this episode will help you rebuild your inner world from the foundation of truth: you are already worthy. Now act like it.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "30-06-25",
                         "length":  "24.22 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/3kogrGWPZTYuebzR40ltVV",
                         "series":  "shmiras-einayim",
                         "episode_number":  9,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 8 - You are Normal",
                         "description":  "What if your deepest struggles don’t define you—but reveal who you really are?When it comes to Shemiras Einayim and controlling our thoughts, many people believe that the battle itself is a sign of failure. But Rabbi Klapper offers a powerful truth: the fight doesn’t mean you’re broken—it means you’re alive. Hashem designed this world with challenges so that we could grow through them. That includes the taiva itself. It’s not inherently evil—it’s meant to become holy. So instead of asking, “Why do I have this?” the real question is, “What am I meant to do with it?”In this episode, we dive into the root of the Yetzer Hara, why Hashem gave us this powerful drive, and how holding it back doesn’t weaken it—it strengthens its potential. Why didn’t Hashem just make us without temptation? And how can understanding our mahus—our essence—help us fight back without losing ourselves in shame or guilt? With stories from the Gemara, insights from the Chazal, and examples from everyday life, Rabbi Klapper shows how embracing who you really are gives you the strength to stand tall, even when you fall.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "16-06-25",
                         "length":  "20.91 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/1J8Sibac25Q5q84PBSeTUH",
                         "series":  "shmiras-einayim",
                         "episode_number":  8,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 7 - Knowing Your Essence",
                         "description":  "What if your biggest fall isn’t the sin—but what you believe about yourself afterward?So many people striving for growth fall into a dangerous trap—not because of their Yetzer Hara, but because of how they respond to it. One misstep, and suddenly, it feels like all their progress has vanished. But Rabbi Klapper offers a radically honest and comforting truth: You are not your failure. You are normal. And falling doesn’t make you broken—it makes you human. The true test isn’t whether you fall, but whether you get back up.In this deeply affirming episode, we explore the power of healthy busha, how to tell the difference between shame that destroys and shame that uplifts, and why your essence—your mahut—is never defined by your mistakes. Why does the Yetzer Hara push perfection so hard? How does focusing on small, winnable battles reshape your identity? And why is just showing up to keep trying the greatest victory of all? With stories, insights, and practical tools, Rabbi Klapper gives you permission to stop being perfect—and start being real.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "02-06-25",
                         "length":  "25.72 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/7qexRjCyNIP1W0XuPnnd3K",
                         "series":  "shmiras-einayim",
                         "episode_number":  7,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 6 - Using Your Time Right",
                         "description":  "What if the best way to fight the Yetzer Hara is not to fight it at all?When we imagine spiritual growth, we often picture intense battles—resisting temptation, wrestling with taivos, fighting off distractions. But the Torah offers a surprising strategy: stay too busy for the Yetzer Hara to catch up. In this episode, Rabbi Klapper explores the concept of misiach daas—not by ignoring the battle, but by turning your focus elsewhere. When your time is filled with purpose, you leave no space for the Yetzer Hara to sneak in. Through a deep look at Paro’s strategy in Mitzrayim and its reversal in avodas Hashem, we uncover how keeping our minds occupied is more than a distraction tactic—it’s a spiritual weapon.From building Torah learning habits one small step at a time, to finding hobbies, jobs, or friends that keep us energized and grounded, this shiur guides you toward a life of intentional action. Why does boredom open the door to aveiros? How can your free time become a tool for growth instead of a trap for failure? And what does it mean to “walk like a businessman” in your daily life? With clarity and warmth, Rabbi Klapper offers a new lens on time management—not as a productivity hack, but as the foundation of kedusha.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "19-05-25",
                         "length":  "31.95 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/7Cum6Aw4adx6Eieyo7uDzg",
                         "series":  "shmiras-einayim",
                         "episode_number":  6,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 5 - How to do Teshuva",
                         "description":  "What if the hardest part of teshuva isn’t change, but admitting you need to?Teshuva doesn\u0027t begin with dramatic resolutions or perfect results. It begins with a moment of clarity—a quiet but powerful realization: Something’s not right. I want more. That simple decision to face ourselves honestly is already a massive step forward. Yet for many, this first step is the most frightening. It means confronting our habits, our history, and the stories we tell ourselves to stay comfortable.In this episode, we uncover the building blocks of real teshuva—what it means to separate recognition from action, how to avoid getting stuck in guilt, and why even a single decision to change shifts your entire direction in life. Drawing from Torah sources and personal experience, Rabbi Klapper offers a step-by-step path to teshuva that’s honest, practical, and sustainable. Whether you’re just beginning or returning again after a fall, this journey starts with one choice: to stop hiding and start growing.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "06-05-25",
                         "length":  "35.84 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/6TbKERWv0B0X032HgHfHOF",
                         "series":  "shmiras-einayim",
                         "episode_number":  5,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 4 - Keep Fighting, Keep Rising",
                         "description":  "What if the Torah itself is the key to breaking free from the Yetzer Hara?Many people assume that learning Torah and personal struggles exist in separate worlds. But Chazal teach us that Torah is not just wisdom—it is the ultimate weapon against the Yetzer Hara. The moment we hold onto it, even if we aren’t perfect, we give ourselves a fighting chance. Letting go, on the other hand, almost guarantees failure.In this episode, we explore why learning—even in the midst of struggle—is the single greatest strategy for overcoming challenges. Why do people give up when they feel like they’re living a double life? How does the Yetzer Hara convince us that failure is final? And why does Hashem say, Just keep holding on? Through real-world stories, deep Torah insights, and practical eitzos, this shiur will give you the tools to stay strong, keep learning, and find the strength to overcome.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "22-04-25",
                         "length":  "25.68 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/1qh2BudJnij8PQr6UEzWi7",
                         "series":  "shmiras-einayim",
                         "episode_number":  4,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 3 - One Step at a Time",
                         "description":  "What if the key to self-mastery isn’t winning every battle, but learning how to keep fighting?So many people struggle with Shemiras Einayim and personal growth because they expect perfection. The moment they stumble, they assume they’ve failed. But what if failure isn’t falling—only staying down? The Yetzer Hara tricks us into thinking that if we can’t do everything, we might as well do nothing. But the truth is, every small step forward rewires our Bechira, making the next victory easier.This episode uncovers the Torah’s approach to growth—how making even the smallest improvements builds momentum. What happens when you push yourself just one minute past your limit? Why does Hashem care more about effort than immediate results? And how can we take control of our struggles instead of being controlled by them? If you’ve ever felt stuck in an endless cycle of setbacks, this conversation will give you the tools to break free, rebuild, and keep climbing.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "25-03-25",
                         "length":  "27.46 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/2lKIkgJitpOb4Cf0khV7Kq",
                         "series":  "shmiras-einayim",
                         "episode_number":  3,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 2 - The Battle for Real Pleasure",
                         "description":  "Is the world offering you real happiness, or just an illusion?We live in a world filled with distractions, desires, and an ever-growing culture that glorifies indulgence. But is what we see and chase after truly satisfying, or is it just a mirage? The Torah teaches us that pleasure isn’t inherently bad—Hashem created it for a purpose. The challenge is directing it towards real, lasting fulfillment rather than fleeting illusions.We explore the core struggle of Shmiras Einayim—not just as a battle of self-control, but as a deeper question of identity, values, and choosing what kind of life we truly want to live. Why do we feel drawn toward things that we know aren’t good for us? How does the Yetzer Hara manipulate our minds into thinking we have no choice? And most importantly—how do we reclaim control and start living in a way that leads to true satisfaction?Through Torah insights, powerful metaphors, and real-world examples, this shiur offers a roadmap to overcoming challenges, resisting the fake, and embracing a life of deeper meaning and true pleasure. If you’ve ever struggled with the pull of the world around you, this episode will give you the tools and perspective to fight back.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "12-03-25",
                         "length":  "28.64 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/2Ha71yWiCNkRfgkDTqNvlT",
                         "series":  "shmiras-einayim",
                         "episode_number":  2,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "S2 Ep. 1 - You Have the Power to Choose",
                         "description":  "Do you really have free will, or are you just following the path laid out for you? Many people feel trapped by their habits, their struggles, and the world around them, believing that real change is impossible. But Chazal teach us a profound truth: the Yetzer Hara is an illusion. It appears like an overwhelming force, but when you examine it closely, you realize—it has no legs to stand on.In this episode, Rabbi Klapper unpacks the deceptiveness of the Yetzer Hara, showing how recognizing its tricks is the first step to overcoming it. Using deep Torah insights—from Yaakov’s battle with the Sar shel Esav to the Gemara’s depiction of the Yetzer Hara as both a mountain and a hair—he builds a step-by-step approach to reclaiming control over your life. How can small, intentional choices reshape your reality? What does it mean to actively shift your focus rather than fight forbidden thoughts head-on? And most importantly, how can you set yourself on a path where you encounter fewer tests to begin with?This episode is a guide to practical strategies for mastering your choices, overcoming challenges, and building the life you truly want—one step at a time.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "26-02-25",
                         "length":  "32.67 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/4TVHCREapjEzPvKFbtei5m",
                         "series":  "shmiras-einayim",
                         "episode_number":  1,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Trailer S2 Shemiras Einayim",
                         "description":  "COMING SOON: The battle for your eyes is real. The power to choose is yours.https://realjudaism.org/ShemirasEinayimShemiras Einayim with Rabbi Ari Klapper returns for Series 2 – diving deeper than ever into the raw challenges of guarding your eyes in today\u0027s digital age. No apologetics. No judgment. Just honest, practical wisdom for real-life struggles.From smartphones to street encounters. From internal battles to external pressures. We\u0027re tackling the questions you\u0027re afraid to ask and the daily tests you face. Rabbi Klapper brings clarity, understanding, and practical tools to help you navigate these challenges while maintaining your dignity and spiritual growth.This isn\u0027t just another mussar series. This is your guide to building real strength and finding true fulfillment in a world of constant visual temptation.New episodes drop every two weeks starting 29th Feb 2025.Real struggles. Real solutions. Real growth. Real Judaism. Shemiras Einayim Series 2 – Because your battle matters.Find the Episodes wherever you get your podcastshttps://open.spotify.com/show/548Vqsw1GzzAGKjmKYi0yc?si=c5e51bbe2d964c3ahttps://podcasts.apple.com/us/podcast/shmiras-einayim/id1784634481https://www.youtube.com/playlist?list=PLiZU2rL9HnBW2qVNZRClAes4STqsKB4qS",
                         "date":  "18-02-25",
                         "length":  "0.99 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/5WkyD2LlphDmI1BKfpIFMH",
                         "series":  "shmiras-einayim",
                         "episode_number":  null,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 15 - Make It Your Goal - Season Finale",
                         "description":  "What’s the key to lasting success in the face of failure?When setbacks feel overwhelming, it’s easy to lose sight of your goals. But the Torah teaches us that even the smallest victories matter deeply to Hashem. How can we hold onto our focus, even when progress feels impossible? And what happens when failure makes us question our ability to keep trying?In this season finale, Rabbi Klapper explores the power of defining clear, meaningful goals in Avodas Hashem. Through moving stories and halachic insights, he explains why every effort—no matter how small—builds towards something eternal. Discover how to balance ambition with realism, maintain a positive perspective in the toughest moments, and align your daily actions with your ultimate spiritual goals. With Torah as your anchor, even the hardest struggles become stepping stones to a life of kedusha and connection. Tune in to learn how to stay grounded, keep growing, and never lose sight of your true purpose.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "26-05-22",
                         "length":  "22.85 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/18z8FdLMvhfvM8R4bqKKBn",
                         "series":  "shmiras-einayim",
                         "episode_number":  15,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 14 - Start Again Now",
                         "description":  "What should you do after you’ve fallen?It’s easy to feel defeated after making a mistake, thinking, “What’s the point of trying again?” But the Torah teaches us that failure is not the end—it’s the beginning of a new opportunity. The Yetzer Hara thrives on our despair, convincing us to stop fighting. How can we overcome this trap and find the strength to start again?In this episode, Rabbi Klapper explains the Torah’s approach to resilience. Through timeless wisdom and relatable examples, he reveals how even a single act of stopping a negative behavior—even after repeated failures—brings immense nachas to Hashem. With practical tools to combat despair and strategies to focus on small victories, this discussion offers a roadmap for turning every fall into a step toward greatness. Discover how Hashem values effort above perfection and why starting again, no matter where you are, is the ultimate key to spiritual growth.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "03-05-22",
                         "length":  "19.35 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/2faDW6nUvHxDUxgsK1kfuD",
                         "series":  "shmiras-einayim",
                         "episode_number":  14,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 13 - Repairing the Damage",
                         "description":  "Can we undo the damage of the past?Every action leaves a mark, but what about the things we see? The Torah teaches that our eyes are gateways to the soul, making Shemiras Einayim not just a mitzvah but a safeguard for our spiritual essence. But what happens when the damage is already done? Is it too late to repair?In this episode, Rabbi Klapper offers profound insights into the power of Teshuva and Tikkun for what our eyes have absorbed. Drawing from the Ben Ish Chai, Rabbeinu Yonah, and other Torah giants, he explains how specific actions—like looking at letters in a Sefer Torah or reflecting on Hashem’s name—can cleanse the soul and restore inner purity. This episode combines deep Torah wisdom with practical advice, reminding listeners that no matter how far we’ve gone, the journey back is always possible. Discover how to rebuild the sanctity of your vision and reconnect with Hashem through small yet transformative steps.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "26-03-22",
                         "length":  "21.73 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/49Vh9fothfFVolet3Z5uJY",
                         "series":  "shmiras-einayim",
                         "episode_number":  13,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 12 - Hirhurim - What is Going on in My Head",
                         "description":  "What’s happening in your mind—and why does it matter so much?The Torah teaches that our thoughts can be even more impactful than our actions. But how is it possible that Hirhurim, fleeting thoughts, carry such weight? And how can we fight back against the overwhelming flood of ideas that invade our minds, especially during moments of kedusha?In this episode, Rabbi Klapper delves into the world of Machshava, exploring the dangers of unguarded thoughts and the tools the Torah gives us to redirect and refine our thinking. With insights from Chazal, the Rambam, and the Nefesh HaChayim, he reveals why our minds are the true Kodesh Kedoshim—a sacred space where our Bechira shapes our spiritual destiny. Through practical strategies and profound encouragement, this episode provides a roadmap for taking control of your inner world and turning Hirhurim into a path of growth and connection to Hashem. Discover the power of your mind and how to channel it toward kedusha.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "20-02-22",
                         "length":  "25.9 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/3DjRtdIGeHmpPkyTwNT4Yx",
                         "series":  "shmiras-einayim",
                         "episode_number":  12,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 11 - Nisyonos",
                         "description":  "Why do our greatest struggles feel so overwhelming?Every person faces Nisyonos, those spiritual and emotional tests that seem custom-made to challenge us. But why does Hashem give us trials that feel insurmountable? And how can we rise above the weight of our personal struggles? In this episode, Rabbi Klapper explores the purpose behind our Nisyonos and how they shape us into greater versions of ourselves.Drawing from the stories, and timeless Torah wisdom, Rabbi Klapper unpacks the delicate balance of hardship and growth. He explains why Hashem designs each trial specifically for us and how these challenges are our unique path to greatness. With practical insights and deep chizuk, this episode reminds listeners that Nisyonos are not barriers but opportunities to lift ourselves higher. Learn how to face your struggles with strength and transform them into a source of spiritual and personal victory.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "29-01-22",
                         "length":  "26.2 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/0bdWLwp1TXM0EQCBZL9s2g",
                         "series":  "shmiras-einayim",
                         "episode_number":  11,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 10 - How Can I Break Away",
                         "description":  "Can small victories lead to big change?Teshuva feels daunting, especially when faced with the weight of long-standing struggles. How can we ever break free from habits that seem ingrained in our lives? In this episode, Rabbi Klapper shares the secret to lasting change: starting small and building consistency. Through relatable examples and deep Torah insights, he shows how focusing on manageable, daily wins can transform even the hardest challenges into opportunities for growth.Drawing from Chazal and modern struggles, this discussion emphasizes the importance of positivity and persistence. Learn how creating short-term goals, staying mindful of your actions, and leaning into the strength of your neshamah can guide you toward lasting transformation. Whether you’re facing internal battles or external pressures, this episode offers actionable advice and inspiring chizuk to help you take the first step on your journey to true freedom and kedusha.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "20-12-21",
                         "length":  "26.93 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/5XUEjn5rvAt5LHWmt90SDI",
                         "series":  "shmiras-einayim",
                         "episode_number":  10,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 9 - How Does the Yetzer Hara Get Me Every Time",
                         "description":  "Why do we fall for the same tricks over and over?The Yetzer Hara isn’t just a challenge—it’s a master illusionist, turning falsehoods into irresistible temptations. Why does it seem to have the upper hand so often? And how can we break free from its relentless cycle? In this episode, Rabbi Klapper uncovers the psychological and spiritual mechanisms behind the Yetzer Hara\u0027s tactics, showing how it exploits both our strengths and vulnerabilities.Through vivid stories, halachic insights, and powerful examples from Chazal, this episode dives deep into the Yetzer Hara’s deceptive strategies. Learn how Hollywood’s illusions and societal pressures feed into its power and how Torah-based sensitivity can help dismantle its grip. With practical advice and profound wisdom, Rabbi Klapper offers listeners the tools to identify the Yetzer Hara’s lies, confront its influence, and find lasting spiritual strength. Discover how seeing through the illusion can transform the battle into a path of growth and kedusha.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "20-12-21",
                         "length":  "22.78 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/7KJmVfcpmJgcKBqEiE9cSi",
                         "series":  "shmiras-einayim",
                         "episode_number":  9,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 8 - Unmasking the Yetzer Hara",
                         "description":  "What makes the Yetzer Hara so powerful?The Yetzer Hara is a master of deception, turning fleeting pleasures into lifelong struggles. But what if you could see through the illusion? In this episode, Rabbi Klapper exposes the tactics of the Yetzer Hara, showing how it capitalizes on our weaknesses while hiding the profound losses behind its promises. How can we fight something that seems so deeply embedded in our lives? And what tools does the Torah give us to resist?Drawing from Chazal, the Chovos Halevavos, and real-life insights, Rabbi Klapper takes listeners on a journey to unmask the Yetzer Hara’s strategies. He explains the psychological tricks it employs, like “stolen waters are sweet,” and shows how recognizing these patterns can shift the battle in our favor. This episode is a guide to understanding the Yetzer Hara’s grip on modern life and building the spiritual strength to overcome it. Tune in for practical wisdom, Torah insights, and a clear path to inner resilience.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "11-10-21",
                         "length":  "23.29 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/4Zxn02Bhk9A8cPwO9nOvfp",
                         "series":  "shmiras-einayim",
                         "episode_number":  8,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 7 - The Benefits of Guarding Your Eyes",
                         "description":  "What do your eyes reveal about your soul?Guarding your eyes is not just about avoiding temptation—it’s about creating a life of clarity, connection, and kedusha. The Torah teaches that what we look at shapes who we are, but the benefits of Shemiras Einayim go far beyond the spiritual. Did you know it can even enhance your ability to learn Torah, strengthen your self-esteem, and protect your peace of mind?In this episode, Rabbi Klapper explores the profound and practical advantages of guarding your gaze. Drawing from classic sources like the Yalkut Shimoni and insights from modern mashgichim, he explains how avoiding unnecessary distractions builds inner resilience and fosters a deeper relationship with Hashem. With examples that span generations of tzadikim and advice tailored to modern challenges, this episode offers tools to help you transform Shemira into a source of spiritual strength and personal empowerment. Discover how choosing what you see can redefine how you live.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "23-08-21",
                         "length":  "17.83 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/5q0Zafrp81cq3RmnNB7tEF",
                         "series":  "shmiras-einayim",
                         "episode_number":  7,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 6 - How to Become Great",
                         "description":  "What’s the secret to true greatness?Greatness doesn’t come from extraordinary actions or public acclaim—it’s forged in quiet moments of restraint. The Torah teaches us that holiness and self-control go hand in hand. But how do we develop the strength to hold back when the yetzer hara feels overwhelming? And what role does loyalty to Hashem play in becoming great?In this episode, Rabbi Klapper explores timeless stories of Gedolim who mastered the art of restraint, from Yosef HaTzadik’s trials in Mitzrayim to Palti Ben Laish’s extraordinary self-control. With profound insights and practical guidance, this episode reveals how greatness isn’t about doing more but about knowing when to stop. By choosing loyalty and self-discipline, we tap into our deepest spiritual potential, paving the path to true kedusha and lasting greatness.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "08-07-21",
                         "length":  "16.1 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/2IvCGE7wRMAMDTPMIRypPa",
                         "series":  "shmiras-einayim",
                         "episode_number":  6,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 5 - The Source of Our Kedusha",
                         "description":  "What we see shapes who we are. In this powerful series, discover the transformative impact of guarding your eyes and how it elevates your spiritual journey. Rooted in Torah wisdom, these episodes delve into the challenges and rewards of protecting one’s vision in a modern world filled with distractions. Gain practical tools, halachic insights, and inspiring chizuk to connect more deeply with Hashem and unlock the kedusha within. Strengthen your inner world by mastering the art of Shmiras Einayim, one choice at a time.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of theReal Judaism series, available on RealJudaism.org. Don’t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!You can contact Rabbi Klapper at rabbiariklapper@gmail.com",
                         "date":  "07-06-21",
                         "length":  "18.64 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/3eBCAUXGPfvJ56PvF7CQ3e",
                         "series":  "shmiras-einayim",
                         "episode_number":  5,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 4 - The Power I Put Into the World",
                         "description":  "Can your struggles create strength for others?The story of Yosef HaTzadik is one of profound trials and ultimate triumph. Thrown into impossible situations, Yosef’s unwavering resistance to temptation didn’t just save him—it created spiritual energy that would shape generations. How can our personal struggles leave a lasting impact, even when no one sees the battles we fight?Rabbi Klapper unpacks Yosef’s journey, showing how his resolve in Mitzrayim laid the foundation for the moral purity of Klal Yisrael. Through Yosef’s example, we learn that every moment of self-control generates strength, not just for ourselves but for others in ways we may never realize. Combining Torah wisdom, personal reflection, and actionable insights, this episode reveals how we, too, can infuse power into the world. When you hold back from what’s forbidden, you don’t just protect yourself—you strengthen Klal Yisrael.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "06-05-21",
                         "length":  "27.4 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/1l3KwOHd8mQPN1HxwJbWYF",
                         "series":  "shmiras-einayim",
                         "episode_number":  4,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 3 - Halacha and Chizuk",
                         "description":  "Why does halacha demand so much?At first glance, the intricate laws surrounding Shemiras Einayim might feel overwhelming. Why does the Torah impose such high expectations in an era filled with challenges? Rabbi Klapper takes us on a journey to uncover the profound wisdom and compassion embedded in these halachos. Through powerful stories and practical advice, he reveals how these laws are not just restrictions but tools for growth and connection with Hashem.Drawing from the Shulchan Aruch and Mishnah Berurah, this episode explains the nuances of Histaklus, the spiritual dangers of unnecessary exposure, and how even fleeting actions shape our inner world. Rabbi Klapper also addresses the role of personal responsibility and the power of community support. Whether you’ve struggled with these halachos or are seeking clarity, this episode offers a roadmap for turning a difficult nisayon into a transformative spiritual opportunity.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "11-04-21",
                         "length":  "30.32 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/22ai3O6jvxYvM5mZSaLK7q",
                         "series":  "shmiras-einayim",
                         "episode_number":  3,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 2 - Self Control",
                         "description":  "Is self-control the key to true freedom?In a world that constantly pulls us toward instant gratification, Rabbi Klapper explores the profound Torah perspective on self-control. Using vivid stories and halachic insights, this episode examines why the ability to restrain oneself is not only a spiritual ideal but also a transformative tool for personal growth. How can we shift our focus from fleeting pleasures to long-lasting fulfillment? And why is self-control described as the defining trait of humanity?Rabbi Klapper walks us through timeless lessons from Chazal and personal anecdotes, showing how mastery over one\u0027s impulses leads to deeper relationships, stronger character, and a more meaningful life. With practical strategies to train our minds and behaviors, this episode is a powerful guide for anyone seeking to align their actions with their values. Tune in to discover the secret to living with purpose, clarity, and inner peace.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "13-03-21",
                         "length":  "24.55 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/2w9Bgc8f5G7m5gsFjTIM6j",
                         "series":  "shmiras-einayim",
                         "episode_number":  2,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     },
                     {
                         "title":  "Ep. 1 - You\u0027re Not Alone",
                         "description":  "What do your eyes say about you?The Torah teaches us that the eyes are more than windows to the soul—they’re gateways to influence, both for good and for challenge. In this episode, Rabbi Klapper dives into the often-overlooked subject of Shemiras Einayim. With honesty and warmth, he unpacks the daily struggles faced by every Jewish man and explains how our visual world shapes who we are. Why is this battle so central to a life of kedusha? And what can we do when it feels like we\u0027re losing the fight?Drawing on the Rambam\u0027s teachings and poignant life stories, this discussion connects the dots between halachic principles and the deeply personal journey of self-discipline. Rabbi Klapper reveals how simple actions, like choosing your surroundings wisely or keeping Torah learning close, can fortify you against the overwhelming challenges of modernity. Whether you’re seeking practical tools or a deeper understanding of your own spiritual journey, this episode offers clarity, strength, and the reassurance that you are never alone in this battle.Hosted by Rabbi Ari Klapper and produced by Eli Podcast Productions, this episode is part of the Real Judaism series, available on RealJudaism.org. Don\u0027t forget to subscribe and share to stay connected with our daily lessons and timeless Torah insights!",
                         "date":  "23-01-21",
                         "length":  "28.74 min",
                         "spotify_embed_url":  "https://open.spotify.com/embed/episode/0srShERc6oe1uymZhPMgfi",
                         "series":  "shmiras-einayim",
                         "episode_number":  1,
                         "file_path":  "data\\Shmiras Einayim_episodes.csv"
                     }
                 ]
}